In [1]:
import pandas as pd
df_school = pd.read_csv('2006-2007_School_Progress_Report.csv')
df_web = pd.read_csv('district_data.csv')

In [2]:
df_web.drop(['Unnamed: 0'], axis=1, inplace=True)

In [3]:
df_school.at[98, 'DISTRICT'] = '5'
df_school.at[527, 'DISTRICT'] = '7'
df_school.at[443, 'DISTRICT'] = '7'
df_school.at[515, 'DISTRICT'] = '8'
df_school.at[405, 'DISTRICT'] = '9'
df_school.at[528, 'DISTRICT'] = '9'
df_web.at[416, 'DISTRICT'] = '10'
df_web.at[417, 'DISTRICT'] = '10'
df_school.at[520, 'DISTRICT']='9'
df_school.at[526, 'DISTRICT'] = '9'
df_web.at[414, 'DISTRICT'] = '12'
df_school.at[1246, 'DISTRICT'] = '12'
df_web.at[1022, 'DISTRICT'] = '12'
df_school.at[1236, 'DISTRICT'] = '13'
df_school.at[1237, 'DISTRICT'] = '17'
df_school.at[1001, 'DISTRICT'] = '19'
df_web.at[1487, 'DISTRICT'] = '23'
df_school.at[1244, 'DISTRICT'] = '25'
df_school.at[1222, 'DISTRICT'] = '26'
df_school.at[1245, 'DISTRICT'] = '31'

### District 1

In [4]:
len(df_school[df_school['DISTRICT']==1])

29

In [5]:
len(df_web[df_web['DISTRICT']==1])

28

In [6]:
# drop index 13, 25, 8, 14, 21
df_school.drop(index=[13,25,8,14, 21], inplace=True)

In [7]:
# drop index 12, 18, 27, 0
df_web.drop(index=[12,18, 27, 0], inplace=True)

In [8]:
# Source: to change a value in the 
# edureka.co/community/43220/how-to-change-update-cell-value-in-python-pandas-dataframe
# change index 7 in df_web to PS063 WILLIAM MCKINLEY
# change index 19 in df_web to THE EAST VILLAGE COMMUNITY SCHOOL
df_web.at[7,'School Name']= 'PS063 WILLIAM MCKINLEY'
df_web.at[19, 'School Name']= 'THE EAST VILLAGE COMMUNITY SCHOOL'
df_school.at[1240, 'DISTRICT']='2'

In [9]:
len(df_web[df_web['DISTRICT']==1].sort_values(by=['School Name']))

24

In [10]:
len(df_school[df_school['DISTRICT']==1].sort_values(by=['SCHOOL']))

24

In [11]:
school_d1 = df_school[df_school['DISTRICT']==1].sort_values(by=['SCHOOL'])
web_d1 = df_web[df_web['DISTRICT']==1].sort_values(by=['School Name'])

In [12]:
school_d1.reset_index(inplace=True)

In [13]:
web_d1.reset_index(inplace=True)

In [14]:
all_d1 = pd.concat([school_d1, web_d1], axis=1)

In [15]:
# fix later
len(all_d1)

24

In [428]:
all_d1.head(1)
# drop column - school name, index (both), DBN, school support, progress report type, District (both)

,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,OVERALL SCORE,...,PERFORMANCE CATEGORY SCORE,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,27,01M696,1,BARD HIGH SCHOOL EARLY COLLEGE,ESO12,HS,High School,3.77,B,57.8,...,0.607,0.524,0,Well-Developed,25,Bard High School Early College,589,17.3,43.5%,1

In [430]:
all_d1.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT'], inplace=True)

### District 2

In [16]:
len(df_school[df_school['DISTRICT']==2])

85

In [17]:
len(df_web[df_web['DISTRICT']==2])

119

In [18]:
school_d2 = df_school[df_school['DISTRICT']==2].sort_values(by=['SCHOOL'])
web_d2 = df_web[df_web['DISTRICT']==2].sort_values(by=['School Name'])

In [19]:
school_d2.reset_index(inplace=True)
web_d2.reset_index(inplace=True)

In [20]:
# school_d2[0:40]
# drop index 1, 5, 7, 11, 21, 27, 37, 40, 45, 75, 84

In [21]:
# web_d2[0:40]
# change index 2 to 47 THE AMERICAN SIGN LANGUAGE AND ENGLISH DUAL LAN
# change index 0 to THE 47 AMERICAN SIGN LANGUAGE & ENGLISH LOWER SCHO
# change index 28 to THE HIGH SCHOOL OF FASHION INDUSTRIES
# change index 56 to M S 131
# change index 55 to MS 255 SALK SCHOOL OF SCIENCE
# change index 39 to JHS 104 SIMON BARUCH
# change index 40 to JHS 167 ROBERT F WAGNER
# change index 63 to NYC LAB MS FOR COLLABORATIVE STUDIES
# change index 68 to PS 001 ALFRED E SMITH
# change index 79 to PS 002 MEYER LONDON
# change index 83 to PS 003 CHARRETTE SCHOOL
# change index 91 to PS 006 LILLIE D. BLAKE
# change index 69 to PS 011 WILLIAM T HARRIS
# change index 84 to PS 033 CHELSEA PREP
# change index 85 to PS 040 AUGUSTUS ST-GAUDENS
# change index 86 to PS 041 GREENWICH VILLAGE
# change index 87 to PS 042 BENJAMIN ALTMAN
# change index 88 to PS 051 ELIAS HOWE
# change index 90 to PS 059 BEEKMAN HILL INTL
# change index 70 to PS 111 ADOLPH S OCHS
# change index 71 to PS 116 MARY LINDLEY MURRAY
# change index 72 to PS 124 YUNG WING
# change index 73 to PS 126 JACOB AUGUST RIIS
# change index 74 to PS 130 HERNANDO DESOTO
# change index 75 to PS 150
# change index 76 to PS 158 BAYARD TAYLOR
# change index 77 to PS 183 ROBERT L STEVENSON
# change index 78 to PS 198 ISADOR E IDA STRAUS
# change index 80 to PS 212 MIDTOWN WEST
# change index 94 to PS 217/IS 217 ROOSEVELT IS.
# change index 81 to PS 234 INDEPENDENCE SCHOOL
# change index 82 to PS 290 MANHATTAN NEW SCHOOL
# change index 92 to PS 77 LOWER LAB SCHOOL
# change index 93 to PS 89

# drop index 1, 6,7, 9, 10, 11, 15, 16, 17, 18, 19, 20, 22, 26, 29, 30, 34, 37, 38, 45, 46
# 47, 49, 51, 56, 58, 61, 65, 66, 89, 95, 98, 101, 102, 103, 106, 109, 110, 111, 112, 113,
# 114, 115, 117, 118

In [22]:
web_d2.at[2,'School Name']= '47 THE AMERICAN SIGN LANGUAGE AND ENGLISH DUAL LAN'
web_d2.at[0, 'School Name']= 'THE 47 AMERICAN SIGN LANGUAGE & ENGLISH LOWER SCHO'
web_d2.at[28, 'School Name']= 'THE HIGH SCHOOL OF FASHION INDUSTRIES'
web_d2.at[56, 'School Name']= 'M S 131'
web_d2.at[55, 'School Name']= 'MS 255 SALK SCHOOL OF SCIENCE'
web_d2.at[39, 'School Name']= 'JHS 104 SIMON BARUCH'
web_d2.at[40, 'School Name']='JHS 167 ROBERT F WAGNER'
web_d2.at[63, 'School Name']='NYC LAB MS FOR COLLABORATIVE STUDIES'
web_d2.at[68, 'School Name']= 'PS 001 ALFRED E SMITH'
web_d2.at[79, 'School Name']='PS 002 MEYER LONDON'
web_d2.at[83, 'School Name']='PS 003 CHARRETTE SCHOOL'
web_d2.at[91, 'School Name']= 'PS 006 LILLIE D. BLAKE'
web_d2.at[69, 'School Name']='PS 011 WILLIAM T HARRIS'
web_d2.at[84, 'School Name']='PS 033 CHELSEA PREP'
web_d2.at[85, 'School Name']='PS 040 AUGUSTUS ST-GAUDENS'
web_d2.at[86, 'School Name']='PS 041 GREENWICH VILLAGE'
web_d2.at[87, 'School Name']='PS 042 BENJAMIN ALTMAN'
web_d2.at[88, 'School Name']='PS 051 ELIAS HOWE'
web_d2.at[90, 'School Name']='PS 059 BEEKMAN HILL INTL'
web_d2.at[70, 'School Name']='PS 111 ADOLPH S OCHS'
web_d2.at[71, 'School Name']='PS 116 MARY LINDLEY MURRAY'
web_d2.at[72, 'School Name']='PS 124 YUNG WING'
web_d2.at[73, 'School Name']='PS 126 JACOB AUGUST RIIS'
web_d2.at[74, 'School Name']='PS 130 HERNANDO DESOTO'
web_d2.at[75, 'School Name']='PS 150'
web_d2.at[76, 'School Name']='PS 158 BAYARD TAYLOR'
web_d2.at[77, 'School Name']='PS 183 ROBERT L STEVENSON'
web_d2.at[78, 'School Name']='PS 198 ISADOR E IDA STRAUS'
web_d2.at[80, 'School Name']='PS 212 MIDTOWN WEST'
web_d2.at[94, 'School Name']='PS 217/IS 217 ROOSEVELT IS.'
web_d2.at[81, 'School Name']='PS 234 INDEPENDENCE SCHOOL'
web_d2.at[82, 'School Name']='PS 290 MANHATTAN NEW SCHOOL'
web_d2.at[92, 'School Name']='PS 77 LOWER LAB SCHOOL'
web_d2.at[93, 'School Name']='PS 89'

In [23]:
school_d2.drop(index=[1, 5, 7, 11, 21, 27, 37, 40, 45, 75, 84], inplace=True)
web_d2.drop(index=[1, 6,7, 9, 10, 11, 15, 16, 17, 18, 19, 20, 22, 26, 29, 30, 34, 37, 38, 45, 46, 47, 49, 51, 56, 58, 61, 65, 66, 89, 95, 98, 101, 102, 103, 106, 109, 110, 111, 112, 113,
114, 115, 117, 118], inplace=True)

In [24]:
school_d2.sort_values(by=['SCHOOL'], inplace=True)
web_d2.sort_values(by=['School Name'], inplace=True)

In [25]:
school_d2.reset_index(inplace=True)
web_d2.reset_index(inplace=True)

In [26]:
print(len(school_d2))
print(len(web_d2))

74
74

In [27]:
all_d2 = pd.concat([school_d2, web_d2], axis=1)

In [28]:
# fix later
len(all_d2)

74

In [431]:
all_d2.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,39,02M047,2,47 THE AMERICAN SIGN LANGUAGE AND ENGLISH DUAL...,ESO4,HS,High School,2.24,F,...,0.279,3,Proficient,2,91,47 THE AMERICAN SIGN LANGUAGE AND ENGLISH DUAL...,170,10.3,88.8%,2

In [433]:
all_d2.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 3

In [29]:
print(len(df_school[df_school['DISTRICT']==3]))
print(len(df_web[df_web['DISTRICT']==3]))

39
44

In [30]:
school_d3 = df_school[df_school['DISTRICT']==3].sort_values(by=['SCHOOL'])
web_d3 = df_web[df_web['DISTRICT']==3].sort_values(by=['School Name'])

In [31]:
school_d3.reset_index(inplace=True)
web_d3.reset_index(inplace=True)

In [32]:
# school_d3
# drop 3, 7, 9, 14, 17, 30, 32, 33, 35, 37

In [33]:
# web_d3['School Name'].iloc[18]
# change index 0 to THE ANDERSON SCHOOL
# change index 2 to MS 258 COMMUNITY ACTION SCHL.
# change index 11 to JHS 054 B00KER T.WASHINGTON
# change index 16 to MS 243 CENTER SCHOOL
# change index 17 to MS 245M THE COMPUTER SCHOOL
# change index 18 to MS 247M DUAL LANGUAGE MID. SCH
# change index 19 to MS 250 WEST SIDE COLLAB. M.S.
# change index 35 to PS 009 SARAH
# change index 31 to PS 075 EMILY DICKINSON
# change index 32 to PS 076 A. PHILIP RANDOLPH
# change index 33 to PS 084 LILLIAN WEBER
# change index 34 to PS 087 WILLIAM SHERMAN
# change index 21 to PS 145, THE BLOOMINGDALE SCHOOL
# change index 22 to PS 149 SOJOURNER TRUTH
# change index 23 to PS 163 ALFRED E SMITH
# change index 24 to PS 165 ROBERT E SIMON
# change index 25 to PS 166 THE RICHARD RODGERS SCHOOL OF THE ARTS AND
# change index 26 to PS 180 HUGO NEWMAN
# change index 27 to PS 199 JESSIE ISADOR STRAUS
# change index 29 to PS 333 MANHATTAN SCHOOL FOR CHILDREN
# change index 28 to PS242M G. P. BROWN COMP. SCHL.
# drop 5, 10, 12, 13, 15, 30, 36, 37, 38, 39, 40, 42, 43

In [34]:
web_d3.at[0, 'School Name']='THE ANDERSON SCHOOL'
web_d3.at[2, 'School Name']='MS 258 COMMUNITY ACTION SCHL.'
web_d3.at[11, 'School Name']='JHS 054 B00KER T.WASHINGTON'
web_d3.at[16, 'School Name']='MS 243 CENTER SCHOOL'
web_d3.at[17, 'School Name']='MS 245M THE COMPUTER SCHOOL'
web_d3.at[18, 'School Name']='MS 247M DUAL LANGUAGE MID. SCH'
web_d3.at[19, 'School Name']='MS 250 WEST SIDE COLLAB. M.S.'
web_d3.at[35, 'School Name']='PS 009 SARAH'
web_d3.at[31, 'School Name']='PS 075 EMILY DICKINSON'
web_d3.at[32, 'School Name']='PS 076 A. PHILIP RANDOLPH'
web_d3.at[33, 'School Name']='PS 084 LILLIAN WEBER'
web_d3.at[34, 'School Name']='PS 087 WILLIAM SHERMAN'
web_d3.at[21, 'School Name']='PS 145, THE BLOOMINGDALE SCHOOL'
web_d3.at[22, 'School Name']='PS 149 SOJOURNER TRUTH'
web_d3.at[23, 'School Name']='PS 163 ALFRED E SMITH'
web_d3.at[24, 'School Name']='PS 165 ROBERT E SIMON'
web_d3.at[25, 'School Name']='PS 166 THE RICHARD RODGERS SCHOOL OF THE ARTS AND SCIENCE'
web_d3.at[26, 'School Name']='PS 180 HUGO NEWMAN'
web_d3.at[27, 'School Name']='PS 199 JESSIE ISADOR STRAUS'
web_d3.at[29, 'School Name']='PS 199 JESSIE ISADOR STRAUS'
web_d3.at[28, 'School Name']='PS242M G. P. BROWN COMP. SCHL.'
web_d3.at[13, 'School Name']='MANHATTAN/HUNTER SCIENCE HIGH SCHOOL'
web_d3.at[14, 'School Name']='MOTT HALL II'
web_d3.at[27, 'School Name']='PS 333 MANHATTAN SCHOOL FOR CHILDREN'

In [35]:
school_d3.drop(index=[3, 7, 9, 14, 17, 30, 32, 33, 35, 37], inplace=True)
web_d3.drop(index=[4, 5, 10, 12, 13, 15, 28, 30, 36, 37, 38, 39, 40, 42, 43], inplace=True)

In [36]:
school_d3.sort_values(by=['SCHOOL'], inplace=True)
web_d3.sort_values(by=['School Name'], inplace=True)

In [37]:
school_d3.reset_index(inplace=True)
web_d3.reset_index(inplace=True)

In [38]:
# web_d3
# drop 4
# change index 13 to MANHATTAN/HUNTER SCIENCE HIGH SCHOOL
# change index 14 to MOTT HALL II
# change index 27 to PS 333 MANHATTAN SCHOOL FOR CHILDREN

In [39]:
print(len(school_d3))
print(len(web_d3))

29
29

In [40]:
all_d3 = pd.concat([school_d3, web_d3], axis=1)

In [41]:
# fix later
len(all_d3)

29

In [434]:
all_d3.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,144,03M479,3,BEACON HIGH SCHOOL,ESO2,HS,High School,3.44,B,...,0.532,3,Well-Developed,1,147,Beacon High School,"1,380",22.5,25.3%,3

In [435]:
all_d3.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 4

In [42]:
print(len(df_school[df_school['DISTRICT']==4]))
print(len(df_web[df_web['DISTRICT']==4]))

32
28

In [43]:
school_d4 = df_school[df_school['DISTRICT']==4].sort_values(by=['SCHOOL'])
web_d4 = df_web[df_web['DISTRICT']==4].sort_values(by=['School Name'])

In [44]:
school_d4.reset_index(inplace=True)
web_d4.reset_index(inplace=True)

In [45]:
# school_d4
# drop 0, 1, 29, 7, 8, 30, 14, 13

In [46]:
# web_d4
# change index 0 to THE BILINGUAL BICULTURAL SCHL
# change index 1 to CENTRAL PARK EAST SECONDARY HIGH SCHOOL
# change index 5 to THE HERITAGE SCHOOL
# change index 9 to MANHATTAN CENTER FOR SCIENCE AND MATHEMATICS
# change index 10 to MS 224 MANH. E.SCHOOL. ARTS&ACAD
# change index 13 to PS 102 JACQUES CARTIER
# change index 14 to PS 108 ASSMBLY ANGELO DEL TORO
# change index 19 to PS 206 JOSE CELSO BABOSA
# change index 16 to PS 146 ANN M SHORT
# change index 17 to PS 155 WILLIAM PACA
# change index 18 to PS 171 PATRICK HENRY
# change index 20 to PS 38 ROBERTO CLEMENTE
# change index 21 to PS 007 SAMUEL STERN
# change index 22 to PS 083 LUIS MUNOZ RIVERA
# change index 23 to PS 096 JOSEPH LANZETTA
# drop 4, 8, 11, 15, 24

In [47]:
web_d4.at[0, 'School Name']= 'THE BILINGUAL BICULTURAL SCHL'
web_d4.at[1, 'School Name']='CENTRAL PARK EAST SECONDARY HIGH SCHOOL'
web_d4.at[5, 'School Name']='THE HERITAGE SCHOOL'
web_d4.at[9, 'School Name']='MANHATTAN CENTER FOR SCIENCE AND MATHEMATICS'
web_d4.at[10, 'School Name']='MS 224 MANH. E.SCHOOL. ARTS&ACAD'
web_d4.at[13, 'School Name']='PS 102 JACQUES CARTIER'
web_d4.at[14, 'School Name']='PS 108 ASSMBLY ANGELO DEL TORO'
web_d4.at[19, 'School Name']='PS 206 JOSE CELSO BABOSA'
web_d4.at[16, 'School Name']='PS 146 ANN M SHORT'
web_d4.at[17, 'School Name']='PS 155 WILLIAM PACA'
web_d4.at[18, 'School Name']='PS 171 PATRICK HENRY'
web_d4.at[20, 'School Name']='PS 38 ROBERTO CLEMENTE'
web_d4.at[21, 'School Name']='PS 007 SAMUEL STERN'
web_d4.at[22, 'School Name']='PS 083 LUIS MUNOZ RIVERA'
web_d4.at[23, 'School Name']='PS 096 JOSEPH LANZETTA'

In [48]:
school_d4.drop(index=[0, 1, 29, 7, 8, 30, 14, 13], inplace=True)
web_d4.drop(index=[4, 8, 11, 15, 24], inplace=True)

In [49]:
school_d4.sort_values(by=['SCHOOL'], inplace=True)

In [50]:
web_d4.sort_values(by=['School Name'], inplace=True)

In [51]:
web_d4.at[2, 'School Name']='CENTRAL PARK EAST I'
web_d4.at[3, 'School Name']='CENTRAL PARK EAST II'
web_d4.at[12, 'School Name']= 'PARK EAST HIGH SCHOOL'
web_d4.at[26, 'School Name']= 'TAG YOUNG SCHOLARS'

In [52]:
school_d4.drop(index=17, inplace=True)

In [53]:
school_d4.sort_values(by=['SCHOOL'], inplace=True)
web_d4.sort_values(by=['School Name'], inplace=True)

In [54]:
school_d4.reset_index(inplace=True)
web_d4.reset_index(inplace=True)

In [55]:
print(len(school_d4))
print(len(web_d4))

23
23

In [56]:
all_d4 = pd.concat([school_d4, web_d4], axis=1)

In [57]:
# fix later
len(all_d4)

23

In [436]:
all_d4.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,2,176,04M497,4,CENTRAL PARK EAST I,ESO3,ESMS,Elementary School,49.80,D,...,0.538,0,Proficient,2,213,CENTRAL PARK EAST I,200,14.2,42%,4

In [437]:
all_d4.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 5

In [58]:
print(len(df_school[df_school['DISTRICT']==5]))
print(len(df_web[df_web['DISTRICT']==5]))

25
27

In [59]:
school_d5 = df_school[df_school['DISTRICT']==5].sort_values(by=['SCHOOL'])
web_d5 = df_web[df_web['DISTRICT']==5].sort_values(by=['School Name'])

In [60]:
school_d5.reset_index(inplace=True)
web_d5.reset_index(inplace=True)

In [61]:
# school_d5
# change index 23 to Thurgood Marshall Academy For Learning & Social Change
# change index 24 to Thurgood Marshall Academy Lower School
# drop 0, 1, 2, 4, 5, 6, 7, 8

In [62]:
# web_d5
# change index 7 to PS 123 MAHALIA JACKSON
# change index 8 to PS 125 RALPH BUNCHE
# change index 9 to PS 129 JOHN H FINLEY
# change index 10 to PS 133 FRED R MOORE
# change index 11 to PS 154 HARRIET TUBMAN
# change index 12 to PS 161 PEDRO ALBIZU CAMPOS
# change index 13 to PS 175 HENRY H GARNET
# change index 14 to PS 194 COUNTEE CULLEN
# change index 15 to PS 197 JOHN B RUSSWURM
# change index 16 to PS 200- THE JAMES McCUNE SMITH SCHOOL
# change index 17 to PS 030 HERNANDEZ/HUGHES
# change index 19 to PS 046 ARTHUR TAPPAN
# change index 20 to PS 092 MARY MCLEOD BETHUNE
# drop 0, 1, 3, 4, 5, 18, 21, 24, 25, 26

In [63]:
school_d5.at[23, 'SCHOOL'] = 'Thurgood Marshall Academy For Learning & Social Change'
school_d5.at[24, 'SCHOOL'] = 'Thurgood Marshall Academy Lower School'
web_d5.at[7, 'School Name']= 'PS 123 MAHALIA JACKSON'
web_d5.at[8, 'School Name']= 'PS 125 RALPH BUNCHE'
web_d5.at[9, 'School Name']= 'PS 129 JOHN H FINLEY'
web_d5.at[10, 'School Name']= 'PS 133 FRED R MOORE'
web_d5.at[11, 'School Name']= 'PS 154 HARRIET TUBMAN'
web_d5.at[12, 'School Name']= 'PS 161 PEDRO ALBIZU CAMPOS'
web_d5.at[13, 'School Name']= 'PS 175 HENRY H GARNET'
web_d5.at[14, 'School Name']= 'PS 194 COUNTEE CULLEN'
web_d5.at[15, 'School Name']= 'PS 197 JOHN B RUSSWURM'
web_d5.at[16, 'School Name']= 'PS 200- THE JAMES McCUNE SMITH SCHOOL'
web_d5.at[17, 'School Name']= 'PS 030 HERNANDEZ/HUGHES'
web_d5.at[19, 'School Name']= 'PS 046 ARTHUR TAPPAN'
web_d5.at[20, 'School Name']= 'PS 092 MARY MCLEOD BETHUNE'

In [64]:
school_d5.drop(index=[0, 1, 2, 4, 5, 6, 7, 8], inplace=True)
web_d5.drop(index=[0, 1, 3, 4, 5, 18, 21, 24, 25, 26], inplace=True)

In [65]:
school_d5.sort_values(by=['SCHOOL'], inplace=True)
web_d5.sort_values(by=['School Name'], inplace=True)

In [66]:
school_d5.reset_index(inplace=True)
web_d5.reset_index(inplace=True)

In [67]:
print(len(school_d5))
print(len(web_d5))

17
17

In [68]:
all_d5 = pd.concat([school_d5, web_d5], axis=1)

In [69]:
len(all_d5)

17

In [438]:
all_d5.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,3,205,05M499,5,FREDERICK DOUGLASS ACADEMY,LLSO1,HS,High School,3.12,B,...,0.524,0,Well-Developed,2,219,Frederick Douglass Academy,"1,360",18.2,76.4%,5

In [439]:
all_d5.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 6

In [70]:
print(len(df_school[df_school['DISTRICT']==6]))
print(len(df_web[df_web['DISTRICT']==6]))

41
46

In [71]:
school_d6 = df_school[df_school['DISTRICT']==6].sort_values(by=['SCHOOL'])
web_d6 = df_web[df_web['DISTRICT']==6].sort_values(by=['School Name'])

In [72]:
school_d6.reset_index(inplace=True)
web_d6.reset_index(inplace=True)

In [73]:
# school_d6
# drop 6, 8, 10, 17, 19, 20, 22, 40

In [74]:
# web_d6
# change 23 to I S 223 MOTT HALL
# change 18 to I.S. 528 BEA FULLER RODGERS SCHOOL
# change 17 to JHS 052 INWOOD
# change 19 to JHS 143 ELEANOR ROOSEVELT
# change 20 to MS 319 - MARIA TERESA
# change 22 to MS 324 - PATRIA
# change 37 to PS 004 DUKE ELLINGTON
# change 39 to PS 005 ELLEN LURIE
# change 40 to PS 008 LUIS BELLIARD
# change 33 to PS 018 PARK TERRACE
# change 36 to PS 028 WRIGHT BROTHERS
# change 38 to PS 048 PO MICHAEL J. BUCZEK
# change 41 to PS 098 SHORAC KAPPOCK
# change 27 to PS 115 ALEXANDER HUMBOLDT
# change 28 to PS 128 AUDUBON
# change 29 to PS 132 JUAN PABLO DUARTE
# change 30 to PS 152 DYCKMAN VALLEY
# change 31 to PS 153 ADAM CLAYTON POWELL
# change 32 to PS 173
# change 42 to PS 187 HUDSON CLIFFS
# change 34 to PS 189
# change 35 to PS 192 JACOB H SCHIFF
# change 43 to PS 210, 21ST CENT ACAD

# drop 2, 4, 5, 6, 7, 9, 10, 12, 13, 25, 26, 44, 45

In [75]:
web_d6.at[23, 'School Name']='I S 223 MOTT HALL'
web_d6.at[18, 'School Name']='I.S. 528 BEA FULLER RODGERS SCHOOL'
web_d6.at[17, 'School Name']='JHS 052 INWOOD'
web_d6.at[19, 'School Name']='JHS 143 ELEANOR ROOSEVELT'
web_d6.at[20, 'School Name']='MS 319 - MARIA TERESA'
web_d6.at[22, 'School Name']='MS 324 - PATRIA'
web_d6.at[37, 'School Name']='PS 004 DUKE ELLINGTON'
web_d6.at[39, 'School Name']='PS 005 ELLEN LURIE'
web_d6.at[40, 'School Name']='PS 008 LUIS BELLIARD'
web_d6.at[33, 'School Name']='PS 018 PARK TERRACE'
web_d6.at[36, 'School Name']='PS 028 WRIGHT BROTHERS'
web_d6.at[38, 'School Name']='PS 048 PO MICHAEL J. BUCZEK'
web_d6.at[41, 'School Name']='PS 098 SHORAC KAPPOCK'
web_d6.at[27, 'School Name']='PS 115 ALEXANDER HUMBOLDT'
web_d6.at[28, 'School Name']='PS 128 AUDUBON'
web_d6.at[29, 'School Name']='PS 132 JUAN PABLO DUARTE'
web_d6.at[30, 'School Name']='PS 152 DYCKMAN VALLEY'
web_d6.at[31, 'School Name']='PS 153 ADAM CLAYTON POWELL'
web_d6.at[32, 'School Name']='PS 173'
web_d6.at[42, 'School Name']='PS 187 HUDSON CLIFFS'
web_d6.at[34, 'School Name']='PS 189'
web_d6.at[35, 'School Name']='PS 192 JACOB H SCHIFF'
web_d6.at[43, 'School Name']='PS 210, 21ST CENT ACAD'

In [76]:
school_d6.drop(index=[6, 8, 10, 17, 19, 20, 22, 40], inplace=True)
web_d6.drop(index=[2, 4, 5, 6, 7, 9, 10, 12, 13, 25, 26, 44, 45], inplace=True)

In [77]:
school_d6.sort_values(by=['SCHOOL'], inplace=True)
web_d6.sort_values(by=['School Name'], inplace=True)

In [78]:
school_d6.reset_index(inplace=True)
web_d6.reset_index(inplace=True)

In [79]:
print(len(school_d6))
print(len(web_d6))

33
33

In [80]:
all_d6 = pd.concat([school_d6, web_d6], axis=1)

In [81]:
len(all_d6)

33

In [440]:
all_d6.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,248,06M540,6,A. PHILIP RANDOLPH CAMPUS HIGH SCHOOL,LLSO1,HS,High School,2.89,B,...,0.485,1.5,Proficient,0,270,A Philip Randolph Campus High School,"1,379",17.9,85.9%,6

In [441]:
all_d6.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 7

In [82]:
print(len(df_school[df_school['DISTRICT']==7]))
print(len(df_web[df_web['DISTRICT']==7]))

39
40

In [83]:
school_d7 = df_school[df_school['DISTRICT']==7].sort_values(by=['SCHOOL'])
web_d7 = df_web[df_web['DISTRICT']==7].sort_values(by=['School Name'])

In [84]:
school_d7.reset_index(inplace=True)
web_d7.reset_index(inplace=True)

In [85]:
# school_d7
# drop 6, 9, 11, 13, 15, 26, 30, 34, 37

In [86]:
# web_d7
# change 38 to BRONX ACADEMY OF LETTERS
# change 15 to JHS 151 LOU GEHRIG
# change 16 to MS 223/THE LABORATORY SCHOOL OF FINANCE AND TECHNO
# change 32 to P.S./I.S. 224
# change 19 to PS 001 COURTLANDT SCHOOL
# change 30 to PS 005 PORT MORRIS
# change 24 to PS 018 JOHN PETER ZENGER
# change 25 to PS 025 BILINGUAL SCHOOL
# chaneg 27 to PS 030 WILTON
# change 28 to PS 043 JONAS BRONCK
# change 29 to PS 049 WILLIS AVE
# change 31 to PS 065 MOTHER HALE ACADEMY
# change 20 to PS 154 JONATHAN D HYATT
# change 21 to PS 157 GROVE HILL
# change 22 to PS 161 PONCE DE LEON
# change 23 to PS 179
# change 26 to PS 277
# change 33 to PS/MS 029 MELROSE SCHOOL
# change 34 to PS/MS 031 THE WILLIAM LLOYD GARRISON
# 
# drop 3, 4, 6, 8, 10, 12, 17, 39

In [87]:
web_d7.at[38, 'School Name'] = 'BRONX ACADEMY OF LETTERS'
web_d7.at[15, 'School Name'] = 'JHS 151 LOU GEHRIG'
web_d7.at[16, 'School Name'] = 'MS 223/THE LABORATORY SCHOOL OF FINANCE AND TECHNO'
web_d7.at[32, 'School Name'] = 'P.S./I.S. 224'
web_d7.at[19, 'School Name'] = 'PS 001 COURTLANDT SCHOOL'
web_d7.at[30, 'School Name'] = 'PS 005 PORT MORRIS'
web_d7.at[24, 'School Name'] = 'PS 018 JOHN PETER ZENGER'
web_d7.at[25, 'School Name'] = 'PS 025 BILINGUAL SCHOOL'
web_d7.at[27, 'School Name'] = 'PS 030 WILTON'
web_d7.at[28, 'School Name'] = 'PS 043 JONAS BRONCK'
web_d7.at[29, 'School Name'] = 'PS 049 WILLIS AVE'
web_d7.at[31, 'School Name'] = 'PS 065 MOTHER HALE ACADEMY'
web_d7.at[20, 'School Name'] = 'PS 154 JONATHAN D HYATT'
web_d7.at[21, 'School Name'] = 'PS 157 GROVE HILL'
web_d7.at[22, 'School Name'] = 'PS 161 PONCE DE LEON'
web_d7.at[23, 'School Name'] = 'PS 179'
web_d7.at[26, 'School Name'] = 'PS 277'
web_d7.at[33, 'School Name'] = 'PS/MS 029 MELROSE SCHOOL'
web_d7.at[34, 'School Name'] = 'PS/MS 031 THE WILLIAM LLOYD GARRISON'

In [88]:
school_d7.drop(index=[6, 9, 11, 13, 15, 26, 30, 34, 37], inplace=True)
web_d7.drop(index=[3, 4, 6, 8, 10, 12, 17, 39], inplace=True)

In [89]:
school_d7.sort_values(by=['SCHOOL'], inplace=True)
web_d7.sort_values(by=['School Name'], inplace=True)

In [90]:
web_d7.drop(index=[13, 14], inplace=True)
# drop 13, 14

In [91]:
school_d7.sort_values(by=['SCHOOL'], inplace=True)
web_d7.sort_values(by=['School Name'], inplace=True)

In [92]:
school_d7.reset_index(inplace=True)
web_d7.reset_index(inplace=True)

In [93]:
print(len(school_d7))
print(len(web_d7))

30
30

In [94]:
all_d7 = pd.concat([school_d7, web_d7], axis=1)

In [95]:
len(all_d7)

30

In [442]:
all_d7.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,276,07X343,7,ACADEMY OF APPLIED MATHEMATICS AND TECHNOLOGY,ESO1,ESMS,Middle School,2.76,A,...,0.738,6,Proficient,0,323,Academy Of Applied Mathematics And Technology,301,15.0,96.3%,7

In [443]:
all_d7.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 8

In [96]:
print(len(df_school[df_school['DISTRICT']==8]))
print(len(df_web[df_web['DISTRICT']==8]))

39
52

In [97]:
school_d8 = df_school[df_school['DISTRICT']==8].sort_values(by=['SCHOOL'])
web_d8 = df_web[df_web['DISTRICT']==8].sort_values(by=['School Name'])

In [98]:
school_d8.reset_index(inplace=True)
web_d8.reset_index(inplace=True)

In [99]:
# school_d8
# drop 0, 1, 3, 5, 11, 14, 15, 20, 27, 36, 38, 7

In [100]:
# web_d8
# change 13 to HERBERT LEHMAN HIGH SCHOOL
# change 15 to JHS 123 JAMES M. KIERNAN
# change 16 to JHS 131 ALBERT EINSTEIN
# change 19 to MS 101X P.O. EDWARD R. BYRNE
# change 22 to MILLENNIUM ART ACADEMY
# change 20 to MS 301 PAUL L. DUNBAR MS
# change 21 to MS 302 LUISA DESSUS CRUZ MS
# change 29 to PS 014 SEN JOHN CALANDRA
# change 35 to PS 036 UNIONPORT
# change 36 to PS 048 JOSEPH R DRAKE
# change 38 to PS 062 INOCENSIO CASANOVA
# change 40 to PS 071 ROSE E SCALA
# change 41 to PS 072 DR WILLIAM DORNEY
# change 42 to PS 075
# change 43 to PS 093 ALBERT G. OLIVER
# change 25 to PS 100 ISSAC CLASON
# change 26 to PS 107
# change 27 to PS 130 ABRAM STEVENS HEWITT
# change 28 to PS 138 SAMUEL RANDALL
# change 30 to PS 140 EAGLE
# change 31 to PS 146 EDWARD COLLINS
# change 32 to PS 152 EVERGREEN
# change 33 to PS 182
# change 34 to PS 304 EARLY CHILDHOOD SCHOOL
# change 45 to THE SCHOOL FOR INQUIRY AND SOCIAL JUSTICE
# drop 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 14, 17, 18, 46, 47, 48, 49, 50, 51, 23, 24, 37, 39

In [101]:
index = [13, 15, 16, 19, 22, 20, 21, 29, 35, 36, 38, 40, 41, 42, 43, 25, 26, 27, 28, 30, 31, 32, 33, 34, 45]
schools = ['HERBERT LEHMAN HIGH SCHOOL', 'JHS 123 JAMES M. KIERNAN', 'JHS 131 ALBERT EINSTEIN', 'MS 101X P.O. EDWARD R. BYRNE',
          'MILLENNIUM ART ACADEMY', 'MS 301 PAUL L. DUNBAR MS', 'MS 302 LUISA DESSUS CRUZ MS', 'PS 014 SEN JOHN CALANDRA',
          'PS 036 UNIONPORT', 'PS 048 JOSEPH R DRAKE', 'PS 062 INOCENSIO CASANOVA', 'PS 071 ROSE E SCALA', 'PS 072 DR WILLIAM DORNEY',
          'PS 075', 'PS 093 ALBERT G. OLIVER', 'PS 100 ISSAC CLASON', 'PS 107', 'PS 130 ABRAM STEVENS HEWITT', 'PS 138 SAMUEL RANDALL',
          'PS 140 EAGLE', 'PS 146 EDWARD COLLINS', 'PS 152 EVERGREEN', 'PS 182', 'PS 304 EARLY CHILDHOOD SCHOOL',
          'THE SCHOOL FOR INQUIRY AND SOCIAL JUSTICE']
for i,j in zip(index,schools):
    web_d8.at[i, 'School Name'] = j

In [102]:
school_d8.drop(index=[0, 1, 3, 5, 11, 14, 15, 20, 27, 36, 38, 7], inplace=True)
web_d8.drop(index=[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 11, 12, 14, 17, 18, 46, 47, 48, 49, 50, 51,
                  23, 24, 37, 39], inplace=True)

In [103]:
school_d8.sort_values(by=['SCHOOL'], inplace=True)
web_d8.sort_values(by=['School Name'], inplace=True)

In [104]:
school_d8.reset_index(inplace=True)
web_d8.reset_index(inplace=True)

In [105]:
print(len(school_d8))
print(len(web_d8))

27
27

In [106]:
all_d8 = pd.concat([school_d8, web_d8], axis=1)

In [107]:
len(all_d8)

27

In [444]:
all_d8.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,2,515,12X269,8,BRONX STUDIO SCHOOL FOR WRITERS AND ARTISTS,ESO13,ESMS,Middle School,3.03,B,...,0.549,0,Well-Developed,10,359,Bronx Studio School For Writers And Artists,644,13.4,85.4%,8

In [445]:
all_d8.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 9

In [108]:
print(len(df_school[df_school['DISTRICT']==9]))
print(len(df_web[df_web['DISTRICT']==9]))

49
64

In [109]:
school_d9 = df_school[df_school['DISTRICT']==9].sort_values(by=['SCHOOL'])
web_d9 = df_web[df_web['DISTRICT']==9].sort_values(by=['School Name'])

In [110]:
school_d9.reset_index(inplace=True)
web_d9.reset_index(inplace=True)

In [111]:
# school_d9
# drop 1, 16, 17, 24, 33, 36, 44, 47

In [112]:
# web_d9[0:44]
# change 19 to I S 229 ROLAND PATTERSON
# change 17 to I.S.117 JOSEPH H WADE
# change 18 to IS 219 NEW VENTURE SCHOOL
# change 20 to IS 232
# change 21 to IS 303 LEADERSHIP & COMM. SER
# change 22 to IS 313 SCHL OF LEADERSHIP DEV.
# change 23 to IS 339 SCHOOL OF COMM. TECH.
# change 24 to JHS 022 JORDAN L MOTT
# change 42 to P.S. 199X THE SHAKESPEARE SCHOOL
# change 55 to P/IS 218 R HERNANDEZ DUAL LANG
# change 35 to PS 011 HIGHBRIDGE
# change 45 to PS 028 MOUNT HOPE
# change 46 to PS 035 FRANZ SIEGEL
# change 47 to PS 042 CLAREMONT
# change 48 to PS 053 BASHEER QUISIM
# change 50 to PS 058
# change 51 to PS 063 AUTHOR'S ACADEMY
# change 52 to PS 070 MAX SCHOENFELD
# change 53 to PS 073 BRONX
# change 34 to PS 109 SEDGWICK
# change 36 to PS 110 THEODORE SCHOENFELD
# change 37 to PS 114 LUIS LLORENS TORRES CHL
# change 38 to PS 126 DR MARJORIE H DUNBAR
# change 39 to PS 132 GARRET A MORGAN
# change 40 to PS 163 ARTHUR A SCHOMBURG
# change 43 to PS 204 MORRIS HEIGHTS
# change 56 to PSMS 004 CROTONA PARK WEST
# change 49 to PS 055 BENJAMIN FRANKLIN
# change 60 to THE URBAN ASSEMBLY SCHOOL FOR APPLIED MATH AND SCI
# drop 0, 1, 2, 3, 7, 9, 10, 12, 14, 16, 26, 28, 30, 31, 32, 41, 44, 54, 58, 59, 61, 62, 63

In [113]:
index_9 = [19, 17, 18, 20, 21, 22, 23, 24, 42, 55, 35, 45, 46, 47, 48, 50, 51, 52, 53, 34, 36, 37, 38, 39, 40, 43,
          56, 49, 60]
schools_9 = ['I S 229 ROLAND PATTERSON', 'I.S.117 JOSEPH H WADE', 'IS 219 NEW VENTURE SCHOOL','IS 232',
            'IS 303 LEADERSHIP & COMM. SER', 'IS 313 SCHL OF LEADERSHIP DEV.', 'IS 339 SCHOOL OF COMM. TECH.',
            'JHS 022 JORDAN L MOTT', 'P.S. 199X THE SHAKESPEARE SCHOOL', 'P/IS 218 R HERNANDEZ DUAL LANG', 
            'PS 011 HIGHBRIDGE', 'PS 028 MOUNT HOPE', 'PS 035 FRANZ SIEGEL', 'PS 042 CLAREMONT', 'PS 053 BASHEER QUISIM',
            'PS 058', 'PS 063 AUTHORS ACADEMY', 'PS 070 MAX SCHOENFELD', 'PS 073 BRONX', 'PS 109 SEDGWICK', 
            'PS 110 THEODORE SCHOENFELD', 'PS 114 LUIS LLORENS TORRES CHL', 'PS 126 DR MARJORIE H DUNBAR', 'PS 132 GARRET A MORGAN',
            'PS 163 ARTHUR A SCHOMBURG', 'PS 204 MORRIS HEIGHTS', 'PSMS 004 CROTONA PARK WEST',
            'PS 055 BENJAMIN FRANKLIN', 'THE URBAN ASSEMBLY SCHOOL FOR APPLIED MATH AND SCI']
for i,j in zip(index_9, schools_9):
    web_d9.at[i, 'School Name'] = j

In [114]:
school_d9.drop(index=[1, 16, 17, 24, 33, 36, 44, 47], inplace=True)
web_d9.drop(index=[0, 1, 2, 3, 7, 9, 10, 12, 14, 16, 26, 28, 30, 31, 32, 41, 44, 54, 58, 59, 61, 62, 63], inplace=True)

In [115]:
school_d9.sort_values(by=['SCHOOL'], inplace=True)
web_d9.sort_values(by=['School Name'], inplace=True)

In [116]:
school_d9.reset_index(inplace=True)
web_d9.reset_index(inplace=True)

In [117]:
print(len(school_d9))
print(len(web_d9))

41
41

In [118]:
all_d9 = pd.concat([school_d9, web_d9], axis=1)

In [119]:
len(all_d9)

41

In [446]:
all_d9.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,370,09X525,9,BRONX LEADERSHIP ACADEMY HIGH SCHOOL,ESO17,HS,High School,2.62,B,...,0.516,1.5,Proficient,4,385,Bronx Leadership Academy High School,574,14.0,87.3%,9

In [447]:
all_d9.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 10

In [120]:
print(len(df_school[df_school['DISTRICT']==10]))
print(len(df_web[df_web['DISTRICT']==10]))

75
87

In [121]:
school_d10 = df_school[df_school['DISTRICT']==10].sort_values(by=['SCHOOL'])
web_d10 = df_web[df_web['DISTRICT']==10].sort_values(by=['School Name'])

In [122]:
school_d10.reset_index(inplace=True)
web_d10.reset_index(inplace=True)

In [123]:
# school_d10[0:44]
# drop 4, 11, 14, 19, 22, 25, 27, 30, 31, 32, 67, 69

In [124]:
# school_d10[44:75]

In [125]:
# web_d10[0:44]
# change 12 to BRONX HIGH SCHOOL OF SCIENCE
# change 25 to FORDHAM LEADERSHIP ACADEMY FOR BUSINESS AND TECHNO
# change 32 to I.S. 254
# change 29 to IN-TECH ACADEMY (MS/HS 368)
# change 31 to IS 206 ANN MERSEREAU
# change 35 to JHS 080 THE MOSHOLU PARKWAY
# change 34 to JHS 118 WILLIAM W NILES
# change 41 to MS 390
# change 70 to PS 008 ISSAC VARIAN
# change 52 to PS 024 SPUYTEN DUYVIL
# change 60 to PS 032 BELMONT
# change 61 to PS 033 TIMOTHY DWIGHT
# change 64 to PS 037 MULTIPLE INTELLIGENCE S
# change 66 to PS 046 EDGAR ALLAN POE
# change 67 to PS 051 BRONX NEW SCHOOL
# change 68 to PS 056 NORWOOD HEIGHTS
# change 69 to PS 059 THE COMM SCHOOL OF TEC
# change 17 to PS 079 CRESTON
# change 71 to PS 081 ROBERT J. CHRISTEN
# change 72 to PS 085 GREAT EXPECTATIONS
# change 73 to PS 086 KINGSBRIDGE HEIGHTS
# change 75 to PS 091 BRONX
# change 76 to PS 094 KINGS COLLEGE SCHOOL
# change 77 to PS 095 SHEILA MENCHER
# change 46 to PS 159 LUIS MUNOZ MARIN BILING
# change 79 to PS 20 P.O.GEORGE J. WERDAN III
# change 54 to PS 279 CAPT MANUEL RIVERA, JR
# change 80 to PS 280 MOSHOLU PARKWAY
# change 56 to PS 3 RAUL JULIA MICRO SOCIETY
# change 78 to PS/IS 54
# change 81 to RIVERDALE/KINGSBRIDGE ACADEMY (MS/HS 141)
# change 74 to RYER AVENUE ELEMENTARY SCHOOL
# change 40 to THE MARIE CURIE HIGH SCHOOL FOR MEDICINE, NURSING
# change 43 to THE NEW SCHOOL FOR LEADERSHIP AND JOURNALISM
# change 85 to WEST BRONX ACADEMY FOR THE FUTURE
# change 16 to THE CELIA CRUZ BRONX HIGH SCHOOL OF MUSIC
# change 30 to INTERNATIONAL SCHOOL OF LIBERAL ARTS
# change 39 to MARBLE HILL HIGH SCHOOL FOR INTERNATIONAL STUDIES
# change 45 to PS 015 INST FOR ENVIRO. LRNG.
# drop 0, 1, 2, 3, 5, 6, 8, 14, 17, 18, 21, 22, 23, 26, 86, 82, 51, 44, 42, 37, 36, 38

In [126]:
# web_d10[44:87]

In [127]:
index_10 = [12, 25, 32, 29, 31, 35, 34, 41, 70, 52, 60, 61, 64, 66, 67, 68, 69, 17, 71, 72, 73, 75, 76, 77,
           46, 79, 54, 80, 56, 78, 81, 74, 40, 43, 85, 16, 30, 39, 45]
school_10 = ['BRONX HIGH SCHOOL OF SCIENCE', 'FORDHAM LEADERSHIP ACADEMY FOR BUSINESS AND TECHNO',
            'I.S. 254', 'IN-TECH ACADEMY (MS/HS 368)', 'IS 206 ANN MERSEREAU', 'JHS 080 THE MOSHOLU PARKWAY',
            'JHS 118 WILLIAM W NILES', 'MS 390', 'PS 008 ISSAC VARIAN', 'PS 024 SPUYTEN DUYVIL', 
            'PS 032 BELMONT', 'PS 033 TIMOTHY DWIGHT', 'PS 037 MULTIPLE INTELLIGENCE S', 'PS 046 EDGAR ALLAN POE',
            'PS 051 BRONX NEW SCHOOL', 'PS 056 NORWOOD HEIGHTS', 'PS 059 THE COMM SCHOOL OF TEC', 'PS 079 CRESTON',
            'PS 081 ROBERT J. CHRISTEN', 'PS 085 GREAT EXPECTATIONS', 'PS 086 KINGSBRIDGE HEIGHTS',
            'PS 091 BRONX', 'PS 094 KINGS COLLEGE SCHOOL', 'PS 095 SHEILA MENCHER', 'PS 159 LUIS MUNOZ MARIN BILING',
            'PS 20 P.O.GEORGE J. WERDAN III', 'PS 279 CAPT MANUEL RIVERA, JR', 'PS 280 MOSHOLU PARKWAY', 
            'PS 3 RAUL JULIA MICRO SOCIETY', 'PS/IS 54', 'RIVERDALE/KINGSBRIDGE ACADEMY (MS/HS 141)', 
            'RYER AVENUE ELEMENTARY SCHOOL', 'THE MARIE CURIE HIGH SCHOOL FOR MEDICINE, NURSING', 
            'THE NEW SCHOOL FOR LEADERSHIP AND JOURNALISM', 'WEST BRONX ACADEMY FOR THE FUTURE', 
            'THE CELIA CRUZ BRONX HIGH SCHOOL OF MUSIC', 'INTERNATIONAL SCHOOL OF LIBERAL ARTS',
            'MARBLE HILL HIGH SCHOOL FOR INTERNATIONAL STUDIES', 'PS 015 INST FOR ENVIRO. LRNG.']
for i,j in zip(index_10, school_10):
    web_d10.at[i, 'School Name']= j

In [128]:
school_d10.drop(index=[4, 11, 14, 19, 22, 25, 27, 30, 31, 32, 67, 69], inplace=True)
web_d10.drop(index=[0, 1, 2, 3, 5, 6, 8, 14, 18, 21, 22, 23, 26, 86, 82, 51, 44, 42, 37,
                   36, 38], inplace=True)

In [129]:
school_d10.sort_values(by=['SCHOOL'], inplace=True)
web_d10.sort_values(by=['School Name'], inplace=True)

In [130]:
print(len(school_d10))
print(len(web_d10))

63
66

In [131]:
# web_d10[0:44]
# change 4 to BELMONT PREPARATORY HIGH SCHOOL
# change 7 to BRONX DANCE ACADEMY SCHOOL
# change 9 to BRONX HIGH SCHOOL FOR LAW AND COMMUNITY SERVICE
# change 10 to BRONX HIGH SCHOOL FOR MEDICAL SCIENCE
# change 11 to BRONX HIGH SCHOOL OF BUSINESS
# change 13 to BRONX SCHOOL OF LAW AND FINANCE
# change 15 to BRONX THEATRE HIGH SCHOOL
# change 24 to FORDHAM HIGH SCHOOL FOR THE ARTS
# change 47 to PS 205 FIORELLO LAGUARDIA
# change 50 to PS 226
# change 53 to PS 246 POE CENTER
# change 55 to PS 291
# change 57 to PS 306
# change 58 to PS 310 MARBLE HILL
# change 59 to PS 315 LAB SCHOOL
# change 62 to PS 340
# change 63 to PS 360
# change 65 to PS 396
# change 83 to THEATRE ARTS PRODUCTION COMPANY SCHOOL
# change 84 to JHS 045 THOMAS C. GIORDANO
# drop 48, 49, 50

In [132]:
index_d10_2 = [4, 7, 9, 10, 11, 13, 15, 24, 47, 50, 53, 55, 57, 58, 59, 62, 63, 65, 83, 84]
school_d10_2 = ['BELMONT PREPARATORY HIGH SCHOOL', 'BRONX DANCE ACADEMY SCHOOL', 
               'BRONX HIGH SCHOOL FOR LAW AND COMMUNITY SERVICE', 'BRONX HIGH SCHOOL FOR MEDICAL SCIENCE',
               'BRONX HIGH SCHOOL OF BUSINESS', 'BRONX SCHOOL OF LAW AND FINANCE', 'BRONX THEATRE HIGH SCHOOL',
               'FORDHAM HIGH SCHOOL FOR THE ARTS', 'PS 205 FIORELLO LAGUARDIA', 'PS 226', 'PS 246 POE CENTER',
               'PS 291', 'PS 306', 'PS 310 MARBLE HILL', 'PS 315 LAB SCHOOL', 'PS 340', 'PS 360', 
               'PS 396', 'THEATRE ARTS PRODUCTION COMPANY SCHOOL', 'JHS 045 THOMAS C. GIORDANO']
for i,j in zip(index_d10_2, school_d10_2):
    web_d10.at[i, 'School Name'] = j

In [133]:
web_d10.drop(index=[48, 49, 50], inplace=True)

In [134]:
school_d10.reset_index(inplace=True)
web_d10.reset_index(inplace=True)

In [135]:
school_d10.sort_values(by=['SCHOOL'], inplace=True)
web_d10.sort_values(by=['School Name'], inplace=True)

In [136]:
print(len(school_d10))
print(len(web_d10))

63
63

In [137]:
all_d10 = pd.concat([school_d10, web_d10], axis=1)

In [138]:
len(all_d10)

63

In [448]:
all_d10.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,434,10X434,10,BELMONT PREPARATORY HIGH SCHOOL,LLSO1,HS,High School,2.34,C,...,0.46,3,Proficient,12,459,BRONX HIGH SCHOOL OF SCIENCE,"2,997",22.3,45.6%,10

In [449]:
all_d10.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 11

In [139]:
print(len(df_school[df_school['DISTRICT']==11]))
print(len(df_web[df_web['DISTRICT']==11]))

42
62

In [140]:
school_d11 = df_school[df_school['DISTRICT']==11].sort_values(by=['SCHOOL'])
web_d11 = df_web[df_web['DISTRICT']==11].sort_values(by=['School Name'])

In [141]:
school_d11.reset_index(inplace=True)
web_d11.reset_index(inplace=True)

In [142]:
# school_d11
# drop 4, 6, 7, 13, 40, 41,

In [143]:
# web_d11[0:44]
# change 22 to I S 181 PABLO CASALS
# change 23 to JHS 127 THE CASTLE HILL
# change 24 to JHS 144 MICHELANGELO
# change 28 to I S 180 DANIEL HALE WILLIAMS
# change 35 to PS 103 HECTOR FONTANEZ
# change 36 to PS 105 SEN ABRAHAM BERNSTEIN
# change 37 to PS 106 PARKCHESTER
# change 38 to PS 108 PHILIP J ABINANTI
# change 39 to PS 111 SETON FALLS
# change 40 to PS 112 BRONXWOOD
# change 41 to PS 121 THROOP
# change 44 to PS 160 WALT DISNEY
# change 45 to PS 175 CITY ISLAND
# change 46 to PS 178 DR SELMAN WAXMAN
# change 42 to PS. 153 HELLEN KELLER
# change 56 to PS 096 RICHARD RODGERS
# change 55 to PS 089 BRONX
# change 54 to PS 087 BRONX
# change 57 to PS 097 BRONX
# change 50 to PS 068 BRONX
# change 49 to PS 041 GUN HILL RD
# change 58 to P.S./I.S. 194
# change 43 to PS 016 WAKEFIELD
# change 47 to PS 019 JUDITH K. WEISS
# change 48 to PS 021 PHILLIP H SHERIDAN
# change 51 to PS 076 THE BENNINGTON SCHOOL
# change 52 to PS 078 ANNE HUTCHINSON
# change 53 to PS 083 DONALD HERTZ
# drop 0, 2, 3, 6, 7, 8, 10, 11, 12, 13, 14, 16, 17, 20, 21, 25, 26, 27, 29, 30, 31, 32, 
# 33, 59, 60, 61

In [144]:
index_11 = [22, 23, 24, 28, 35, 36, 37, 38, 39, 40, 41, 44, 45, 46, 42, 56, 55, 54, 57, 50,
           49, 58, 43, 47, 48, 51, 52, 53]
school_11 = ['I S 181 PABLO CASALS', 'JHS 127 THE CASTLE HILL', 'JHS 144 MICHELANGELO',
            'I S 180 DANIEL HALE WILLIAMS', 'PS 103 HECTOR FONTANEZ', 'PS 105 SEN ABRAHAM BERNSTEIN',
            'PS 106 PARKCHESTER', 'PS 108 PHILIP J ABINANTI', 'PS 111 SETON FALLS', 'PS 112 BRONXWOOD',
            'PS 121 THROOP', 'PS 160 WALT DISNEY', 'PS 175 CITY ISLAND', 'PS 178 DR SELMAN WAXMAN',
            'PS. 153 HELLEN KELLER', 'PS 096 RICHARD RODGERS', 'PS 089 BRONX', 'PS 087 BRONX',
            'PS 097 BRONX', 'PS 068 BRONX', 'PS 041 GUN HILL RD', 'P.S./I.S. 194', 'PS 016 WAKEFIELD',
            'PS 019 JUDITH K. WEISS', 'PS 021 PHILLIP H SHERIDAN', 'PS 076 THE BENNINGTON SCHOOL',
            'PS 078 ANNE HUTCHINSON', 'PS 083 DONALD HERTZ']
for i,j in zip(index_11, school_11):
    web_d11.at[i, 'School Name'] = j

In [145]:
school_d11.drop(index=[4, 6, 7, 13, 40, 41], inplace=True)
web_d11.drop(index=[0, 2, 3, 6, 7, 8, 10, 11, 12, 13, 14, 16, 17, 20, 21, 25, 26, 27, 29, 30, 31, 32, 
                    33, 59, 60, 61], inplace=True)

In [146]:
print(len(school_d11))
print(len(web_d11))

36
36

In [147]:
school_d11.reset_index(inplace=True)
web_d11.reset_index(inplace=True)

In [148]:
school_d11.sort_values(by=['SCHOOL'], inplace=True)
web_d11.sort_values(by=['School Name'], inplace=True)

In [149]:
all_d11 = pd.concat([school_d11, web_d11], axis=1)

In [150]:
len(all_d11)

36

In [450]:
all_d11.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,481,11X299,11,ASTOR COLLEGIATE ACADEMY,LLSO2,HS,High School,2.64,A,...,0.4,7.5,Proficient,1,575,Astor Collegiate Academy,470,15.6,74.3%,11

In [451]:
all_d11.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 12

In [151]:
print(len(df_school[df_school['DISTRICT']==12]))
print(len(df_web[df_web['DISTRICT']==12]))

43
48

In [152]:
school_d12 = df_school[df_school['DISTRICT']==12].sort_values(by=['SCHOOL'])
web_d12 = df_web[df_web['DISTRICT']==12].sort_values(by=['School Name'])

In [153]:
school_d12.reset_index(inplace=True)
web_d12.reset_index(inplace=True)

In [154]:
# school_d12
# drop 0, 6, 2, 17, 18, 20, 24, 29, 30

In [155]:
# web_d12
# change 12 to IS 190
# change 19 to IS 318 MATH SCI &TECH THRU ART
# change 20 to JHS 098 HERMAN RIDDER
# change 21 to KAPPA III
# change 24 to PS 129 TWIN PARKS UPPER
# change 39 to PS 006 WEST FARMS
# change 35 to PS 044 DAVID C FARRAGUT
# change 36 to PS 047 JOHN RANDOLPH
# change 38 to PS 057 CRESCENT
# change 40 to PS 061 FRANCISCO OLLER
# change 41 to PS 066 SCH OF HIGHER EXPECTAT
# change 42 to PS 067 MOHEGAN SCHOOL
# change 27 to PS 134 GEORGE F BRISTOW
# change 28 to PS 150 CHARLES JAMES FOX
# change 29 to PS 195
# change 30 to PS 196
# change 31 to PS 198
# change 32 to PS 211
# change 33 to PS 212
# change 34 to PS 214
# change 45 to THE SCHOOL OF SCIENCE AND APPLIED LEARNING
# drop 1, 2, 3, 4, 9, 11, 13, 14, 22, 23, 26, 37, 43, 46

In [156]:
index_12 = [12, 19, 20, 21, 24, 39, 35, 36, 38, 40, 41, 42, 27, 28, 29, 30, 31, 32, 33,
           34, 45]
school_12 = ['IS 190', 'IS 318 MATH SCI &TECH THRU ART', 'JHS 098 HERMAN RIDDER', 'KAPPA III',
            'PS 129 TWIN PARKS UPPER', 'PS 006 WEST FARMS', 'PS 044 DAVID C FARRAGUT', 
            'PS 047 JOHN RANDOLPH', 'PS 057 CRESCENT', 'PS 061 FRANCISCO OLLER', 
            'PS 066 SCH OF HIGHER EXPECTAT', 'PS 067 MOHEGAN SCHOOL', 'PS 134 GEORGE F BRISTOW',
            'PS 150 CHARLES JAMES FOX', 'PS 195', 'PS 196', 'PS 198', 'PS 211', 'PS 212', 'PS 214',
            'THE SCHOOL OF SCIENCE AND APPLIED LEARNING']
for i,j in zip(index_12, school_12):
    web_d12.at[i, 'School Name'] = j

In [157]:
school_d12.drop(index=[0, 6, 2, 17, 18, 20, 24, 29, 30], inplace=True)
web_d12.drop(index=[1, 2, 3, 4, 9, 11, 13, 14, 22, 23, 26, 37, 43, 46], inplace=True)

In [158]:
print(len(school_d12))
print(len(web_d12))

34
34

In [159]:
school_d12.reset_index(inplace=True)
web_d12.reset_index(inplace=True)

In [160]:
school_d12.sort_values(by=['SCHOOL'], inplace=True)
web_d12.sort_values(by=['School Name'], inplace=True)

In [161]:
all_d12 = pd.concat([school_d12, web_d12], axis=1)

In [162]:
len(all_d12)

34

In [452]:
all_d12.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,1,524,12X341,12,ACCION ACADEMY,ESO7,ESMS,Middle School,3.04,B,...,0.607,3,Undeveloped,0,626,Accion Academy,152,13.8,91.4%,12

In [453]:
all_d12.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 13

In [163]:
print(len(df_school[df_school['DISTRICT']==13]))
print(len(df_web[df_web['DISTRICT']==13]))

36
40

In [164]:
school_d13 = df_school[df_school['DISTRICT']==13].sort_values(by=['SCHOOL'])
web_d13 = df_web[df_web['DISTRICT']==13].sort_values(by=['School Name'])

In [165]:
school_d13.reset_index(inplace=True)
web_d13.reset_index(inplace=True)

In [166]:
# school_d13
# drop 0, 10, 6, 12, 32, 33, 35

In [167]:
# web_d13
# change 11 to JHS 265 SUSAN S. MCKINNEY
# change 14 to JHS 113/OLD 294 EDMONDS CNTR
# change 15 to MS 266 PARK PLACE COMM. MS
# change 23 to PS 003 THE BEDFORD VILLAGE
# change 16 to PS 011 PURVIS J BEHAN
# change 17 to PS 133 WILLIAM A BUTLER
# change 18 to PS 020 CLINTON HILL
# change 19 to PS 256 BENJAMIN BANNEKER
# change 20 to PS 270 JOHANN DEKALB
# change 21 to PS 282 PARK SLOPE
# change 22 to PS 287 BAILEY K ASHFORD
# change 24 to PS 305 DR PETER RAY
# change 25 to PS 307 DANIEL HALE WILLIAMS
# change 26 to PS 044 MARCUS GARVEY
# change 27 to PS 046 EDWARD C BLUM
# change 28 to PS 054 SAMUEL C BARNES
# change 29 to PS 056 LEWIS H LATIMER
# change 30 to PS 067 CHARLES A DORSEY
# change 31 to PS 008 ROBERT FULTON
# change 32 to PS 009 TEUNIS G BERGEN
# change 33 to PS 093 WILLIAM H PRESCOTT
# drop 0, 4, 5, 8, 9, 10, 12, 36, 37, 38, 39

In [168]:
index_13 = [11, 14, 15, 23, 16, 17, 18, 19, 20, 21, 22, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33]
school_13 = ['JHS 265 SUSAN S. MCKINNEY', 'JHS 113/OLD 294 EDMONDS CNTR', 'MS 266 PARK PLACE COMM. MS', 
            'PS 003 THE BEDFORD VILLAGE', 'PS 011 PURVIS J BEHAN', 'PS 133 WILLIAM A BUTLER', 
            'PS 020 CLINTON HILL', 'PS 256 BENJAMIN BANNEKER', 'PS 270 JOHANN DEKALB', 'PS 282 PARK SLOPE',
            'PS 287 BAILEY K ASHFORD', 'PS 305 DR PETER RAY', 'PS 307 DANIEL HALE WILLIAMS', 
            'PS 044 MARCUS GARVEY','PS 046 EDWARD C BLUM', 'PS 054 SAMUEL C BARNES', 'PS 056 LEWIS H LATIMER', 
            'PS 067 CHARLES A DORSEY', 'PS 008 ROBERT FULTON', 'PS 009 TEUNIS G BERGEN', 
            'PS 093 WILLIAM H PRESCOTT']
for i,j in zip(index_13, school_13):
    web_d13.at[i, 'School Name'] = j

In [169]:
school_d13.drop(index=[0, 10, 6, 12, 32, 33, 35], inplace=True)
web_d13.drop(index=[0, 4, 5, 8, 9, 10, 12, 36, 37, 38, 39], inplace=True)

In [170]:
print(len(school_d13))
print(len(web_d13))

29
29

In [171]:
school_d13.reset_index(inplace=True)
web_d13.reset_index(inplace=True)

In [172]:
school_d13.sort_values(by=['SCHOOL'], inplace=True)
web_d13.sort_values(by=['School Name'], inplace=True)

In [173]:
all_d13 = pd.concat([school_d13, web_d13], axis=1)

In [174]:
len(all_d13)

29

In [454]:
all_d13.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,1,568,13K595,13,BEDFORD ACADEMY HIGH SCHOOL,ESO8,HS,High School,3.03,A,...,1.113,0,Well-Developed,1,671,Bedford Academy High School,368,16.7,73.4%,13

In [455]:
all_d13.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 14

In [175]:
print(len(df_school[df_school['DISTRICT']==14]))
print(len(df_web[df_web['DISTRICT']==14]))

31
38

In [176]:
school_d14 = df_school[df_school['DISTRICT']==14].sort_values(by=['SCHOOL'])
web_d14 = df_web[df_web['DISTRICT']==14].sort_values(by=['School Name'])

In [177]:
school_d14.reset_index(inplace=True)
web_d14.reset_index(inplace=True)

In [178]:
# school_d14
# drop 29, 30, 12,

In [179]:
# web_d14
# change 7 to THE HIGH SCHOOL FOR ENTERPRISE, BUSINESS, AND TECH
# change 8 to JHS 318 EUGENIO MARIA DEHOSTOS
# change 9 to JHS 126 JOHN ERICSSON
# change 11 to JHS 050 JOHN D WELLS
# change 13 to MS 582
# change 15 to PS 110 THE MONITOR
# change 16 to PS 120 CARLOS TAPIA
# change 17 to PS 132 CONSELYA
# change 18 to PS 147 ISSAC REMSEN
# change 19 to PS 016 LEONARD DUNKLY
# change 20 to PS 017 HENRY D WOODWORTH
# change 21 to PS 018 EDWARD BUSH
# change 22 to PS 196 TEN EYCK
# change 23 to PS 023 CARTER C WOODSON
# change 24 to PS 250 GEORGE H LINDSAY
# change 25 to PS 257 JOHN F HYLAN
# change 26 to PS 297 ABRAHAM STOCKTON
# change 27 to PS 031 SAMUEL F DUPONT
# change 29 to PS 034 OLIVER H PERRY
# change 30 to PS 380 JOHN WAYNE ELEM.
# change 31 to PS 059 WILLIAM FLOYD
# change 32 to PS 084 JOSE DE DIEGO
# change 33 to PS 157 BENJAMIN FRANKLIN
# drop 1, 2, 3, 5, 12, 28, 34, 35, 36, 37

In [180]:
index_14 = [7, 8, 9, 11, 13, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 29, 30, 31, 32, 33]
school_14 = ['THE HIGH SCHOOL FOR ENTERPRISE, BUSINESS, AND TECH', 'JHS 318 EUGENIO MARIA DEHOSTOS', 
            'JHS 126 JOHN ERICSSON', 'JHS 050 JOHN D WELLS', 'MS 582', 'PS 110 THE MONITOR', 
            'PS 120 CARLOS TAPIA', 'PS 132 CONSELYA', 'PS 147 ISSAC REMSEN', 'PS 016 LEONARD DUNKLY',
            'PS 017 HENRY D WOODWORTH', 'PS 018 EDWARD BUSH', 'PS 196 TEN EYCK', 'PS 023 CARTER C WOODSON',
            'PS 250 GEORGE H LINDSAY', 'PS 257 JOHN F HYLAN', 'PS 297 ABRAHAM STOCKTON', 'PS 031 SAMUEL F DUPONT',
            'PS 034 OLIVER H PERRY', 'PS 380 JOHN WAYNE ELEM.', 'PS 059 WILLIAM FLOYD', 'PS 084 JOSE DE DIEGO', 
            'PS 157 BENJAMIN FRANKLIN']
for i,j in zip(index_14, school_14):
    web_d14.at[i, 'School Name'] = j

In [181]:
school_d14.drop(index=[29, 30, 12], inplace=True)
web_d14.drop(index=[1, 2, 3, 5, 12, 28, 34, 35, 36, 37], inplace=True)

In [182]:
print(len(school_d14))
print(len(web_d14))

28
28

In [183]:
school_d14.reset_index(inplace=True)
web_d14.reset_index(inplace=True)

In [184]:
school_d14.sort_values(by=['SCHOOL'], inplace=True)
web_d14.sort_values(by=['School Name'], inplace=True)

In [185]:
all_d14 = pd.concat([school_d14, web_d14], axis=1)

In [186]:
len(all_d14)

28

In [456]:
all_d14.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,600,14K610,14,AUTOMOTIVE HIGH SCHOOL,ESO9,HS,High School,2.41,F,...,0.291,0,Proficient,0,685,Automotive High School,404,10.9,80.4%,14

In [457]:
all_d14.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 15

In [187]:
print(len(df_school[df_school['DISTRICT']==15]))
print(len(df_web[df_web['DISTRICT']==15]))

46
47

In [188]:
school_d15 = df_school[df_school['DISTRICT']==15].sort_values(by=['SCHOOL'])
web_d15 = df_web[df_web['DISTRICT']==15].sort_values(by=['School Name'])

In [189]:
school_d15.reset_index(inplace=True)
web_d15.reset_index(inplace=True)

In [190]:
# school_d15
# drop 0, 1, 3, 4, 10, 11, 13, 36, 37, 39, 40, 41, 42

In [191]:
# web_d15
# change 1 to BROOKLYN SECONDARY SCHOOL FOR COLLABORATIVE STUDIES
# change 4 to PS 146
# change 7 to IS 136 CHARLES O DEWEY
# change 9 to JHS 088 PETER ROUGET
# change 11 to MAGNET SCH. OF MATH, SCI. AND DESIGN TECHNOLOGY
# change 15 to MS 51 WILLIAM ALEXANDER
# change 20 to PS 001 THE BERGEN
# change 25 to PS 015 PATRICK F. DALY
# change 29 to PS 024
# change 31 to PS 029 JOHN M HARRIGAN
# change 33 to PS 032 SAMUELS MILLS SPROLE
# change 35 to PS 038 THE PACIFIC
# change 36 to PS 039 HENRY BRISTOW
# change 37 to PS 058 THE CARROLL
# change 38 to PS 094 THE HENRY LONGFELLOW
# change 21 to PS 107 JOHN W KIMBALL
# change 22 to PS 124 SILAS B DUTCHER
# change 23 to PS 130 THE PARKSIDE
# change 24 to PS 131 BROOKLYN
# change 26 to PS 169 SUNSET PARK
# change 27 to PS 172 BEACON SCH OF EXCELLEN
# change 28 to PS 230 DORIS L COHEN
# change 30 to PS 261 PHILIP LIVINGSTON
# change 32 to PS 295
# change 34 to PS 321 WILLIAM PENN
# change 0 to SCHOOL FOR INTERNATIONAL STUDIES
# change 12 to THE MATH & SCIENCE EXPLORATORY SCHOOL
# drop 1, 2, 6, 8, 10, 13, 14, 16, 17, 19, 39, 42, 43, 45, 46

In [192]:
index_15 = [1, 4, 7, 9, 11, 15, 20, 25, 29, 31, 33, 35, 36, 37, 38, 21, 22, 23, 24, 26, 27, 28, 30, 32, 34, 0,
           12]
school_15 = ['BROOKLYN SECONDARY SCHOOL FOR COLLABORATIVE STUDIES', 'PS 146', 'IS 136 CHARLES O DEWEY', 
            'JHS 088 PETER ROUGET', 'MAGNET SCH. OF MATH, SCI. AND DESIGN TECHNOLOGY', 'MS 51 WILLIAM ALEXANDER',
            'PS 001 THE BERGEN', 'PS 015 PATRICK F. DALY', 'PS 024', 'PS 029 JOHN M HARRIGAN',
            'PS 032 SAMUELS MILLS SPROLE', 'PS 038 THE PACIFIC', 'PS 039 HENRY BRISTOW', 'PS 058 THE CARROLL', 
            'PS 094 THE HENRY LONGFELLOW', 'PS 107 JOHN W KIMBALL', 'PS 124 SILAS B DUTCHER', 
            'PS 130 THE PARKSIDE', 'PS 131 BROOKLYN', 'PS 169 SUNSET PARK', 'PS 172 BEACON SCH OF EXCELLEN',
            'PS 230 DORIS L COHEN', 'PS 261 PHILIP LIVINGSTON', 'PS 295', 'PS 321 WILLIAM PENN', 
            'SCHOOL FOR INTERNATIONAL STUDIES', 'THE MATH & SCIENCE EXPLORATORY SCHOOL']
for i,j in zip(index_15, school_15):
    web_d15.at[i, 'School Name'] = j

In [193]:
school_d15.drop(index=[0, 1, 3, 4, 10, 11, 13, 36, 37, 39, 40, 41, 42], inplace=True)
web_d15.drop(index=[2, 6, 8, 10, 13, 14, 16, 17, 19, 39, 42, 43, 45, 46], inplace=True)

In [194]:
print(len(school_d15))
print(len(web_d15))

33
33

In [195]:
school_d15.reset_index(inplace=True)
web_d15.reset_index(inplace=True)

In [196]:
school_d15.sort_values(by=['SCHOOL'], inplace=True)
web_d15.sort_values(by=['School Name'], inplace=True)

In [197]:
all_d15 = pd.concat([school_d15, web_d15], axis=1)

In [198]:
len(all_d15)

33

In [458]:
all_d15.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,2,645,15K656,15,BROOKLYN HIGH SCHOOL OF THE ARTS,ESO12,HS,High School,2.90,C,...,0.257,6,Well-Developed,0,750,SCHOOL FOR INTERNATIONAL STUDIES,633,14.3,57.5%,15

In [459]:
all_d15.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 16

In [199]:
print(len(df_school[df_school['DISTRICT']==16]))
print(len(df_web[df_web['DISTRICT']==16]))

20
24

In [200]:
school_d16 = df_school[df_school['DISTRICT']==16].sort_values(by=['SCHOOL'])
web_d16 = df_web[df_web['DISTRICT']==16].sort_values(by=['School Name'])

In [201]:
school_d16.reset_index(inplace=True)
web_d16.reset_index(inplace=True)

In [202]:
# school_d16
# drop 1, 4, 15, 19

In [203]:
# web_d16
# change 6 to JHS 057 WHITELAW REID
# change 8 to MS 267 MATH, SCIENCE & TECH.
# change 9 to PS 035 STEPHEN DECATUR
# change 11 to PS 021 CRISPUS ATTUCKS
# change 12 to PS 243 WEEKSVILLE
# change 13 to PS 025 EUBIE BLAKE SCHOOL
# change 14 to PS 026 JESSE OWENS
# change 15 to PS 262 EL HAJJ MALIK SHABAZZ
# change 16 to PS 028 THE WARREN
# change 17 to PS 308 CLARA CARDWELL
# change 18 to PS 309 GEORGE E WIBECAN
# change 19 to PS 335 GRANVILLE T WOODS
# change 20 to PS 040 GEORGE W CARVER
# change 21 to PS 005 DR. RONALD MCNAIR
# change 22 to PS 081 THADDEUS STEVENS
# drop 1, 2, 3, 4, 5, 7, 10, 23

In [204]:
index_16 = [6, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22]
school_16 = ['JHS 057 WHITELAW REID', 'MS 267 MATH, SCIENCE & TECH.', 'PS 035 STEPHEN DECATUR', 'PS 021 CRISPUS ATTUCKS',
            'PS 243 WEEKSVILLE', 'PS 025 EUBIE BLAKE SCHOOL', 'PS 026 JESSE OWENS', 'PS 262 EL HAJJ MALIK SHABAZZ', 
            'PS 028 THE WARREN', 'PS 308 CLARA CARDWELL', 'PS 309 GEORGE E WIBECAN', 'PS 335 GRANVILLE T WOODS',
            'PS 040 GEORGE W CARVER', 'PS 005 DR. RONALD MCNAIR', 'PS 081 THADDEUS STEVENS']
for i,j in zip(index_16, school_16):
    web_d16.at[i, 'School Name'] = j

In [205]:
school_d16.drop(index=[1, 4, 15, 19], inplace=True)
web_d16.drop(index=[1, 2, 3, 4, 5, 7, 10, 23], inplace=True)

In [206]:
print(len(school_d16))
print(len(web_d16))

16
16

In [207]:
school_d16.reset_index(inplace=True)
web_d16.reset_index(inplace=True)

In [208]:
school_d16.sort_values(by=['SCHOOL'], inplace=True)
web_d16.sort_values(by=['School Name'], inplace=True)

In [209]:
all_d16 = pd.concat([school_d16, web_d16], axis=1)

In [210]:
len(all_d16)

16

In [460]:
all_d16.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,666,16K455,16,BOYS AND GIRLS HIGH SCHOOL,CLSO7,HS,High School,2.44,C,...,0.512,0,Proficient,0,769,Boys And Girls High School,412,13.7,79.6%,16

In [461]:
all_d16.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 17

In [211]:
print(len(df_school[df_school['DISTRICT']==17]))
print(len(df_web[df_web['DISTRICT']==17]))

42
48

In [212]:
school_d17 = df_school[df_school['DISTRICT']==17].sort_values(by=['SCHOOL'])
web_d17 = df_web[df_web['DISTRICT']==17].sort_values(by=['School Name'])

In [213]:
school_d17.reset_index(inplace=True)
web_d17.reset_index(inplace=True)

In [214]:
# school_d17
# drop 7, 10, 13, 14, 15, 17, 18, 19, 20, 25, 37, 41

In [215]:
# web_d17
# change 15 to HIGH SCHOOL FOR PUBLIC SERVICE: HEROES OF TOMORROW
# change 17 to IS 340
# change 19 to IS 246 WALT WHITMAN
# change 18 to MEDGAR EVERS PREPARATORY SCHOOL AT MEDGAR EVERS CO
# change 20 to MS 394K
# change 21 to M S 061 GLADSTONE H. ATWELL
# change 31 to PS 191 PAUL ROBESON
# change 27 to PS 138 BROOKLYN
# change 28 to PS 161 THE CROWN
# change 29 to PS 181 BROOKLYN
# change 30 to PS 189 LINCOLN TERRACE
# change 32 to PS 221 TOSSAINT L'OUVERTURE
# change 33 to PS 241 EMMA L JOHNSTON
# change 35 to PS 289 GEORGE V BROWER
# change 36 to PS 316 ELIJAH STROUD
# change 37 to PS 375 JACKIE-ROBINSON SCHOOL
# change 38 to PS 397 FOSTER-LAURIE
# change 39 to PS 398 WALTER WEAVER
# change 40 to PS 399 STANLEY EUGENE CLARK
# change 42 to PS 091 THE ALBANY AVE. SCHOOL
# change 43 to PS 092 ADRIAN HEGEMAN
# change 45 to THE SCHOOL FOR HUMAN RIGHTS
# change 46 to THE SCHOOL OF INTEGRATED LEARNING
# change 47 to SCIENCE,TECHNOLOGY AND RESEARCH EARLY COLLEGE HIGH
# drop 0, 1, 2, 4, 5, 9, 12, 13, 14, 16, 22, 23, 24, 25, 26, 34, 41, 44

In [216]:
index_17 = [15, 17, 19, 18, 20, 21, 31, 27, 28, 29, 30, 32, 33, 35, 36, 37, 38, 39, 40, 42, 43, 45, 46, 47]
school_17 = ['HIGH SCHOOL FOR PUBLIC SERVICE: HEROES OF TOMORROW', 'IS 340', 'IS 246 WALT WHITMAN',
            'MEDGAR EVERS PREPARATORY SCHOOL AT MEDGAR EVERS CO', 'MS 394K', 'M S 061 GLADSTONE H. ATWELL', 
            'PS 191 PAUL ROBESON', 'PS 138 BROOKLYN', 'PS 161 THE CROWN', 'PS 181 BROOKLYN', 
            'PS 189 LINCOLN TERRACE', 'PS 221 TOSSAINT LOUVERTURE', 'PS 241 EMMA L JOHNSTON', 
            'PS 289 GEORGE V BROWER', 'PS 316 ELIJAH STROUD', 'PS 375 JACKIE-ROBINSON SCHOOL', 
            'PS 397 FOSTER-LAURIE', 'PS 398 WALTER WEAVER', 'PS 399 STANLEY EUGENE CLARK', 
            'PS 091 THE ALBANY AVE. SCHOOL', 'PS 092 ADRIAN HEGEMAN', 'THE SCHOOL FOR HUMAN RIGHTS',
            'THE SCHOOL OF INTEGRATED LEARNING', 'SCIENCE,TECHNOLOGY AND RESEARCH EARLY COLLEGE HIGH']
for i,j in zip(index_17, school_17):
    web_d17.at[i, 'School Name'] = j

In [217]:
school_d17.drop(index=[7, 10, 13, 14, 15, 17, 18, 19, 20, 25, 37, 41], inplace=True)
web_d17.drop(index=[0, 1, 2, 4, 5, 9, 12, 13, 14, 16, 22, 23, 24, 25, 26, 34, 41, 44], inplace=True)

In [218]:
print(len(school_d17))
print(len(web_d17))

30
30

In [219]:
school_d17.reset_index(inplace=True)
web_d17.reset_index(inplace=True)

In [220]:
school_d17.sort_values(by=['SCHOOL'], inplace=True)
web_d17.sort_values(by=['School Name'], inplace=True)

In [221]:
all_d17 = pd.concat([school_d17, web_d17], axis=1)

In [222]:
len(all_d17)

30

In [462]:
all_d17.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,703,17K547,17,BROOKLYN ACADEMY OF SCIENCE AND THE ENVIRONMENT,New Visions1,HS,High School,2.73,B,...,0.548,3,Proficient,3,821,Brooklyn Academy Of Science And The Environment,368,16.7,82.3%,17

In [463]:
all_d17.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 18

In [223]:
print(len(df_school[df_school['DISTRICT']==18]))
print(len(df_web[df_web['DISTRICT']==18]))

17
33

In [224]:
school_d18 = df_school[df_school['DISTRICT']==18].sort_values(by=['SCHOOL'])
web_d18 = df_web[df_web['DISTRICT']==18].sort_values(by=['School Name'])

In [225]:
school_d18.reset_index(inplace=True)
web_d18.reset_index(inplace=True)

In [226]:
# school_d18
# drop 0, 11

In [227]:
# web_d18
# change 10 to IS 211 JOHN WILSON
# change 11 to IS 285 MEYER LEVIN
# change 12 to IS 068 ISAAC BILDERSEE
# change 17 to PS 114 RYDER ELEMENTARY
# change 18 to PS 115 DANIEL MUCATEL SCHOOL
# change 19 to PS 135 SHELDON A. BROOKNER
# change 20 to PS 208 ELSA EBELING
# change 21 to PS 219 KENNEDY-KING
# change 22 to PS 233 LANGSTON HUGHES
# change 24 to PS 244 RICHARD R. GREEN
# change 25 to PS 268 EMMA LAZARUS
# change 26 to PS 272 CURTIS ESTABROOK
# change 27 to PS 276 LOUIS MARSHALL
# change 28 to PS 279 HERMAN SCHREIBER
# change 29 to P.S. 66
# drop 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 13, 14, 15, 16, 23, 30, 31, 32

In [228]:
index_18 = [10, 11, 12, 17, 18, 19, 20, 21, 22, 24, 25, 26, 27, 28, 29]
school_18 = ['IS 211 JOHN WILSON', 'IS 285 MEYER LEVIN', 'IS 068 ISAAC BILDERSEE', 'PS 114 RYDER ELEMENTARY',
            'PS 115 DANIEL MUCATEL SCHOOL', 'PS 135 SHELDON A. BROOKNER', 'PS 208 ELSA EBELING', 
            'PS 219 KENNEDY-KING', 'PS 233 LANGSTON HUGHES', 'PS 244 RICHARD R. GREEN', 'PS 268 EMMA LAZARUS',
            'PS 272 CURTIS ESTABROOK', 'PS 276 LOUIS MARSHALL', 'PS 279 HERMAN SCHREIBER', 'P.S. 66']
for i,j in zip(index_18, school_18):
    web_d18.at[i, 'School Name'] = j

In [229]:
school_d18.drop(index=[0, 11], inplace=True)
web_d18.drop(index=[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 13, 14, 15, 16, 23, 30, 31, 32], inplace=True)

In [230]:
print(len(school_d18))
print(len(web_d18))

15
15

In [231]:
school_d18.reset_index(inplace=True)
web_d18.reset_index(inplace=True)

In [232]:
school_d18.sort_values(by=['SCHOOL'], inplace=True)
web_d18.sort_values(by=['School Name'], inplace=True)

In [233]:
all_d18 = pd.concat([school_d18, web_d18], axis=1)

In [234]:
len(all_d18)

15

In [464]:
all_d18.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,1,711,18K068,18,IS 068 ISAAC BILDERSEE,ICI3,ESMS,Middle School,2.95,C,...,0.443,3,Proficient,10,846,IS 211 JOHN WILSON,521,15.3,83.9%,18

In [465]:
all_d18.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 19

In [235]:
print(len(df_school[df_school['DISTRICT']==19]))
print(len(df_web[df_web['DISTRICT']==19]))

35
48

In [236]:
school_d19 = df_school[df_school['DISTRICT']==19].sort_values(by=['SCHOOL'])
web_d19 = df_web[df_web['DISTRICT']==19].sort_values(by=['School Name'])

In [237]:
school_d19.reset_index(inplace=True)
web_d19.reset_index(inplace=True)

In [238]:
# school_d19
# drop 1, 2, 3, 6, 9, 12, 13, 19, 25

In [239]:
# web_d19
# change 13 to I S 171 ABRAHAM LINCOLN
# change 14 to I S 364 GATEWAY
# change 15 to JHS 218 JAMES P SINNOTT
# change 16 to JHS 292 MARGARET S DOUGLAS
# change 20 to PS 108 SAL ABBRACCIAMENTO
# change 21 to PS 013 ROBERTO CLEMENTE
# change 22 to PS 149 DANNY KAYE
# change 23 to PS 158 WARWICK
# change 24 to PS 159 ISAAC PITKIN
# change 25 to PS 190 SHEFFIELD
# change 26 to PS 202 ERNEST S JENKYNS
# change 27 to PS 213 NEW LOTS
# change 28 to PS 214 MICHAEL FRIEDSAM
# change 29 to PS 224 HALE A WOODRUFF
# change 30 to PS 273 WORTMAN
# change 31 to PS 290 JUAN MOREL CAMPOS
# change 32 to PS 306 ETHAN ALLEN
# change 33 to PS 328 PHYLLIS WHEATLEY
# change 34 to PS 345 PATROLMAN ROBERT BOLDEN
# change 35 to PS 346 ABE STARK
# change 36 to PS 65
# change 37 to PS 007 ABRAHAM LINCOLN
# change 38 to PS 089 CYPRESS HILLS
# change 42 to TRANSIT TECH CAREER AND TECHNICAL EDUCATION HIGH S
# change 46 to W. H. MAXWELL CAREER AND TECHNICAL EDUCATION HIGH
# drop 0, 1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 17, 18, 19, 39, 40, 41,  43, 44, 45, 47

In [240]:
index_19 = [13, 14, 15, 16, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 42, 46]
school_19 = ['I S 171 ABRAHAM LINCOLN', 'I S 364 GATEWAY', 'JHS 218 JAMES P SINNOTT', 
             'JHS 292 MARGARET S DOUGLAS', 'PS 108 SAL ABBRACCIAMENTO', 'PS 013 ROBERTO CLEMENTE', 
             'PS 149 DANNY KAYE', 'PS 158 WARWICK', 'PS 159 ISAAC PITKIN', 'PS 190 SHEFFIELD', 
             'PS 202 ERNEST S JENKYNS', 'PS 213 NEW LOTS', 'PS 214 MICHAEL FRIEDSAM', 'PS 224 HALE A WOODRUFF',
             'PS 273 WORTMAN', 'PS 290 JUAN MOREL CAMPOS', 'PS 306 ETHAN ALLEN', 'PS 328 PHYLLIS WHEATLEY', 
             'PS 345 PATROLMAN ROBERT BOLDEN', 'PS 346 ABE STARK', 'PS 65', 'PS 007 ABRAHAM LINCOLN', 
             'PS 089 CYPRESS HILLS', 'TRANSIT TECH CAREER AND TECHNICAL EDUCATION HIGH S', 
             'W. H. MAXWELL CAREER AND TECHNICAL EDUCATION HIGH']
for i,j in zip(index_19, school_19):
    web_d19.at[i, 'School Name'] = j

In [241]:
school_d19.drop(index=[1, 2, 3, 6, 9, 12, 13, 19, 25], inplace=True)
web_d19.drop(index=[0, 1, 2, 3, 4, 5, 6, 8, 9, 10, 11, 12, 17, 18, 19, 39, 40, 41,  43, 44, 45, 47], inplace=True)

In [242]:
print(len(school_d19))
print(len(web_d19))

26
26

In [243]:
school_d19.reset_index(inplace=True)
web_d19.reset_index(inplace=True)

In [244]:
school_d19.sort_values(by=['SCHOOL'], inplace=True)
web_d19.sort_values(by=['School Name'], inplace=True)

In [245]:
all_d19 = pd.concat([school_d19, web_d19], axis=1)

In [246]:
len(all_d19)

26

In [466]:
all_d19.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,755,19K409,19,EAST NEW YORK FAMILY ACADEMY,ESO9,ESMS,Middle School,3.49,A,...,0.538,0,Well-Developed,7,874,East New York Family Academy,501,12.0,87.6%,19

In [467]:
all_d19.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 20

In [247]:
print(len(df_school[df_school['DISTRICT']==20]))
print(len(df_web[df_web['DISTRICT']==20]))

34
43

In [248]:
school_d20 = df_school[df_school['DISTRICT']==20].sort_values(by=['SCHOOL'])
web_d20 = df_web[df_web['DISTRICT']==20].sort_values(by=['School Name'])

In [249]:
school_d20.reset_index(inplace=True)
web_d20.reset_index(inplace=True)

In [250]:
# school_d20
# drop 21, 24

In [251]:
# web_d20
# change 5 to I S 187
# change 6 to JHS 201 THE DYKER HEIGHTS
# change 7 to JHS 220 JOHN J PERSHING
# change 8 to JHS 223 THE MONTAUK
# change 9 to JHS 227 EDWARD B SHALLOW
# change 10 to JHS 259 WILLIAM MCKINLEY
# change 11 to JHS 062 THE DITMAS
# change 13 to PS 102 THE BAYVIEW
# change 14 to PS 105 THE BLYTHEBOURNE
# change 15 to PS 112 LEFFERTS PARK
# change 16 to PS 127 MCKINLEY PARK
# change 17 to PS 160 William T. Sampson
# change 18 to PS 163 BATH BEACH
# change 19 to PS 164 CAESAR RODNEY
# change 20 to PS 176 OVINGTON
# change 21 to PS 179 KENSINGTON
# change 22 to PS 185 WALTER KASSENBROCK
# change 23 to PS 186 DR. IRVING A GLADSTONE
# change 24 to PS 192 BROOKLYN
# change 25 to PS 200 BENSON SCHOOL
# change 26 to PS 204 VINCE LOMBARDI
# change 27 to PS 205 CLARION
# change 28 to PS 229 DYKER
# change 29 to PS 247 BROOKLYN
# change 31 to PS 048 MAPELTON
# change 34 to PS 69 Vincent D. Grippo School
# change 36 to PS / IS 104 THE FORT HAMILTON SCHOOL
# change 37 to IS 30 MARY WHITE OVINGTON
# drop 0, 1, 30, 32, 33, 35, 38, 39, 40 ,41, 42

In [252]:
index_20 = [5, 6, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 31, 34, 36,
           37]
school_20 = ['I S 187', 'JHS 201 THE DYKER HEIGHTS', 'JHS 220 JOHN J PERSHING', 'JHS 223 THE MONTAUK', 
            'JHS 227 EDWARD B SHALLOW', 'JHS 259 WILLIAM MCKINLEY', 'JHS 062 THE DITMAS',
            'PS 102 THE BAYVIEW', 'PS 105 THE BLYTHEBOURNE', 'PS 112 LEFFERTS PARK', 'PS 127 MCKINLEY PARK', 
            'PS 160 William T. Sampson', 'PS 163 BATH BEACH', 'PS 164 CAESAR RODNEY', 'PS 176 OVINGTON', 
            'PS 179 KENSINGTON', 'PS 185 WALTER KASSENBROCK', 'PS 186 DR. IRVING A GLADSTONE', 
            'PS 192 BROOKLYN', 'PS 200 BENSON SCHOOL', 'PS 204 VINCE LOMBARDI', 'PS 205 CLARION', 
            'PS 229 DYKER', 'PS 247 BROOKLYN', 'PS 048 MAPELTON', 'PS 69 Vincent D. Grippo School',
            'PS / IS 104 THE FORT HAMILTON SCHOOL', 'IS 30 MARY WHITE OVINGTON']
for i,j in zip(index_20, school_20):
    web_d20.at[i, 'School Name'] = j

In [253]:
school_d20.drop(index=[21, 24], inplace=True)
web_d20.drop(index=[0, 1, 30, 32, 33, 35, 38, 39, 40 ,41, 42], inplace=True)

In [254]:
print(len(school_d20))
print(len(web_d20))

32
32

In [255]:
school_d20.reset_index(inplace=True)
web_d20.reset_index(inplace=True)

In [256]:
school_d20.sort_values(by=['SCHOOL'], inplace=True)
web_d20.sort_values(by=['School Name'], inplace=True)

In [257]:
all_d20 = pd.concat([school_d20, web_d20], axis=1)

In [258]:
len(all_d20)

32

In [468]:
all_d20.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,792,20K490,20,FORT HAMILTON HIGH SCHOOL,ESO6,HS,High School,2.78,B,...,0.683,1.5,Well-Developed,2,925,Fort Hamilton High School,"4,580",20.3,72.1%,20

In [469]:
all_d20.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 21

In [259]:
print(len(df_school[df_school['DISTRICT']==21]))
print(len(df_web[df_web['DISTRICT']==21]))

34
40

In [260]:
school_d21 = df_school[df_school['DISTRICT']==21].sort_values(by=['SCHOOL'])
web_d21 = df_web[df_web['DISTRICT']==21].sort_values(by=['School Name'])

In [261]:
school_d21.reset_index(inplace=True)
web_d21.reset_index(inplace=True)

In [262]:
# school_d21
# drop 2

In [263]:
# web_d21
# change 6 to IS 228 DAVID A BOODY
# change 7 to IS 281 JOSEPH B CAVALLARO
# change 8 to IS 303 Herbert S. Eisenberg
# change 9 to IS 096 SETH LOW
# change 10 to IS 98 BAY ACADEMY
# change 15 to Mark Twain I.S. 239 for the Gifted & Talented
# change 16 to PS 100 THE CONEY ISLAND SCHOOL
# change 17 to PS 101 THE VERRAZANO
# change 18 to PS 121 NELSON A ROCKEFELLER
# change 19 to PS 128 BENSONHURST
# change 20 to PS 153 HOMECREST
# change 21 to PS 177 THE MARLBORO
# change 22 to PS 188 MICHAEL E BERDY
# change 23 to PS 199 FREDERICK WACHTEL
# change 24 to PS 209 MARGARET MEAD
# change 25 to PS 212 LADY DEBORAH MOODY
# change 26 to P.S. 215 MORRIS H. WEISS
# change 27 to PS 216 ARTURO TOSCANINI
# change 28 to P.S. 225 THE EILEEN E ZAGLIN
# change 29 to PS 226 ALFRED DE B.MASON
# change 30 to PS 238 Anne Sullivan
# change 31 to PS 253
# change 32 to PS 288 THE SHIRLEY TANYHILL
# change 33 to PS 329 SURFSIDE
# change 34 to PS 90 EDNA COHEN 
# change 35 to PS 095 THE GRAVESEND
# change 36 to PS 97 The Highlawn
# change 37 to PS 099 ISAAC ASIMOV
# change 39 to WILLIAM E. GRADY CAREER AND TECHNICAL EDUCATION HI
# drop 3, 4, 5, 12, 13, 14, 36, 38

In [264]:
index_21 = [6, 7, 8, 9, 10, 15, 16, 17, 18, 19, 20, 21, 22, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36,
              37, 39]
school_21 = ['IS 228 DAVID A BOODY', 'IS 281 JOSEPH B CAVALLARO', 'IS 303 Herbert S. Eisenberg', 
             'IS 096 SETH LOW', 'IS 98 BAY ACADEMY', 'Mark Twain I.S. 239 for the Gifted & Talented', 
             'PS 100 THE CONEY ISLAND SCHOOL', 'PS 101 THE VERRAZANO', 'PS 121 NELSON A ROCKEFELLER', 
             'PS 128 BENSONHURST', 'PS 153 HOMECREST', 'PS 177 THE MARLBORO', 'PS 188 MICHAEL E BERDY', 
             'PS 199 FREDERICK WACHTEL', 'PS 209 MARGARET MEAD', 'PS 212 LADY DEBORAH MOODY', 
             'P.S. 215 MORRIS H. WEISS', 'PS 216 ARTURO TOSCANINI', 'P.S. 225 THE EILEEN E ZAGLIN',
             'PS 226 ALFRED DE B.MASON', 'PS 238 Anne Sullivan', 'PS 253', 'PS 288 THE SHIRLEY TANYHILL',
             'PS 329 SURFSIDE', 'PS 90 EDNA COHEN ', 'PS 095 THE GRAVESEND',
             'PS 97 The Highlawn', 'PS 099 ISAAC ASIMOV', 'WILLIAM E. GRADY CAREER AND TECHNICAL EDUCATION HI']
for i,j in zip(index_21, school_21):
    web_d21.at[i, 'School Name'] = j

In [265]:
school_d21.drop(index=2, inplace=True)
web_d21.drop(index=[3, 4, 5, 12, 13, 14, 38], inplace=True)

In [266]:
print(len(school_d21))
print(len(web_d21))

33
33

In [267]:
school_d21.reset_index(inplace=True)
web_d21.reset_index(inplace=True)

In [268]:
school_d21.sort_values(by=['SCHOOL'], inplace=True)
web_d21.sort_values(by=['School Name'], inplace=True)

In [269]:
all_d21 = pd.concat([school_d21, web_d21], axis=1)

In [270]:
len(all_d21)

33

In [470]:
all_d21.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,822,21K410,21,ABRAHAM LINCOLN HIGH SCHOOL,CLSO2,HS,High School,2.69,C,...,0.491,1.5,Proficient,0,965,Abraham Lincoln High School,"1,946",16.6,78.6%,21

In [471]:
all_d21.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 22

In [271]:
print(len(df_school[df_school['DISTRICT']==22]))
print(len(df_web[df_web['DISTRICT']==22]))

37
39

In [272]:
school_d22 = df_school[df_school['DISTRICT']==22].sort_values(by=['SCHOOL'])
web_d22 = df_web[df_web['DISTRICT']==22].sort_values(by=['School Name'])

In [273]:
school_d22.reset_index(inplace=True)
web_d22.reset_index(inplace=True)

In [274]:
# school_d22
# drop 2, 21, 32, 36

In [275]:
# web_d22
# change 2 to I. S. 381
# change 4 to JHS 014 SHELL BANK
# change 5 to JHS 234 ARTHUR W CUNNINGHAM
# change 6 to JHS 278 MARINE PARK
# change 7 to JHS 078 ROY H MANN
# change 13 to PS 109
# change 14 to PS 119 AMERSFORT
# change 15 to K134
# change 16 to PS 139 ALEXINE A. FENTY
# change 17 to PS 193 GIL HODGES
# change 18 to PS 194 RAOUL WALLENBERG
# change 19 to PS 195 MANHATTAN BEACH
# change 20 to PS 197 BROOKLYN
# change 21 to PS 203 FLOYD BENNETT
# change 22 to PS 206 JOSEPH F LAMB
# change 23 to PS 207 ELIZABETH G. LEARY
# change 24 to PS 217 COLONEL DAVID MARCUS SCHOOL
# change 25 to PS 222 KATHERINE R SNYDER
# change 26 to PS 236 MILL BASIN
# change 27 to PS 245
# change 28 to PS 251 PAEDERGAT
# change 29 to PS 254 DAG HAMMARSKJOLD
# change 30 to PS 255 BARBARA REING SCHOOL
# change 31 to PS 277 GERRITSEN BEACH
# change 32 to PS 312 BERGEN BEACH
# change 33 to P.S. 315 DIST 22.
# change 36 to PS 052 SHEEPSHEAD BAY
# change 38 to SCHOOL OF SCIENCE & TECHNOLOGY
# drop 9, 11, 12, 34, 35, 37

In [276]:
index_22 = [2, 4, 5, 6, 7, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 36, 38]
school_22 = ['I. S. 381', 'JHS 014 SHELL BANK', 'JHS 234 ARTHUR W CUNNINGHAM', 'JHS 278 MARINE PARK',
            'JHS 078 ROY H MANN', 'PS 109', 'PS 119 AMERSFORT', 'K134', 'PS 139 ALEXINE A. FENTY', 
            'PS 193 GIL HODGES', 'PS 194 RAOUL WALLENBERG', 'PS 195 MANHATTAN BEACH', 'PS 197 BROOKLYN', 
            'PS 203 FLOYD BENNETT', 'PS 206 JOSEPH F LAMB', ' PS 207 ELIZABETH G. LEARY', 
            'PS 217 COLONEL DAVID MARCUS SCHOOL', 'PS 222 KATHERINE R SNYDER', 'PS 236 MILL BASIN', 'PS 245',
            'PS 251 PAEDERGAT', 'PS 254 DAG HAMMARSKJOLD', 'PS 255 BARBARA REING SCHOOL', 
            'PS 277 GERRITSEN BEACH', 'PS 312 BERGEN BEACH', 'P.S. 315 DIST 22.', 'PS 052 SHEEPSHEAD BAY', 
            'SCHOOL OF SCIENCE & TECHNOLOGY']
for i,j in zip(index_22, school_22):
    web_d22.at[i, 'School Name'] = j

In [277]:
school_d22.drop(index=[2, 21, 32, 36], inplace=True)
web_d22.drop(index=[9, 11, 12, 34, 35, 37], inplace=True)

In [278]:
print(len(school_d22))
print(len(web_d22))

33
33

In [279]:
school_d22.reset_index(inplace=True)
web_d22.reset_index(inplace=True)

In [280]:
school_d22.sort_values(by=['SCHOOL'], inplace=True)
web_d22.sort_values(by=['School Name'], inplace=True)

In [281]:
all_d22 = pd.concat([school_d22, web_d22], axis=1)

In [282]:
len(all_d22)

33

In [472]:
all_d22.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,849,22K240,22,ANDRIES HUDDE,ICI3,ESMS,Middle School,3.47,B,...,0.532,9,Undeveloped,0,1029,Andries Hudde,753,15.4,84.7%,22

In [473]:
all_d22.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 23

In [283]:
print(len(df_school[df_school['DISTRICT']==23]))
print(len(df_web[df_web['DISTRICT']==23]))

22
30

In [284]:
school_d23 = df_school[df_school['DISTRICT']==23].sort_values(by=['SCHOOL'])
web_d23 = df_web[df_web['DISTRICT']==23].sort_values(by=['School Name'])

In [285]:
school_d23.reset_index(inplace=True)
web_d23.reset_index(inplace=True)

In [286]:
# school_d23
# drop 6, 13, 15, 18, 20

In [287]:
# web_d23
# change 8 to EBC/ENY HIGH SCHOOL FOR PUBLIC SAFETY & LAW
# change 11 to IS 392
# change 12 to KAPPA V
# change 16 to PS 150 CHRISTOPHER
# change 17 to PS 156 WAVERLY
# change 18 to PS 165 IDA POSNER
# change 19 to PS 178 ST.CLAIR MCKELWAY
# change 20 to PS 184 NEWPORT
# change 21 to PS 298 DR. BETTY SHABAZZ
# change 22 to PS 327 DR. ROSE B. ENGLISH
# change 23 to PS 041 FRANCIS WHITE
# change 24 to PS 137 RACHEL JEAN MITCHELL
# change 25 to PS 155 NICHOLAS HERKIMER
# change 26 to PS/IS 323
# drop 0, 2, 3, 4, 5, 6, 7, 9, 10, 13, 14, 27, 28

In [288]:
index_23 = [8, 11, 12, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26]
school_23 = ['EBC/ENY HIGH SCHOOL FOR PUBLIC SAFETY & LAW', 'IS 392', 'KAPPA V', 'PS 150 CHRISTOPHER', 
            'PS 156 WAVERLY', 'PS 165 IDA POSNER', 'PS 178 ST.CLAIR MCKELWAY', 'PS 184 NEWPORT', 
            'PS 298 DR. BETTY SHABAZZ', 'PS 327 DR. ROSE B. ENGLISH', 'PS 041 FRANCIS WHITE', 
            'PS 137 RACHEL JEAN MITCHELL', 'PS 155 NICHOLAS HERKIMER', 'PS/IS 323']
for i,j in zip(index_23, school_23):
    web_d23.at[i, 'School Name'] = j

In [289]:
school_d23.drop(index=[6, 13, 15, 18, 20], inplace=True)
web_d23.drop(index=[0, 2, 3, 4, 5, 6, 7, 9, 10, 13, 14, 27, 28], inplace=True)

In [290]:
print(len(school_d23))
print(len(web_d23))

17
17

In [291]:
school_d23.reset_index(inplace=True)
web_d23.reset_index(inplace=True)

In [292]:
school_d23.sort_values(by=['SCHOOL'], inplace=True)
web_d23.sort_values(by=['School Name'], inplace=True)

In [293]:
all_d23 = pd.concat([school_d23, web_d23], axis=1)

In [294]:
len(all_d23)

17

In [474]:
all_d23.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,881,23K493,23,BROOKLYN COLLEGIATE: A COLLEGE BOARD SCHOOL,KNLSO3,ESMS,Middle School,3.41,D,...,0.221,1.5,Proficient,1,1059,Brooklyn Collegiate: A College Board School,266,12.2,95.1%,23

In [475]:
all_d23.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 24

In [295]:
print(len(df_school[df_school['DISTRICT']==24]))
print(len(df_web[df_web['DISTRICT']==24]))

39
56

In [296]:
school_d24 = df_school[df_school['DISTRICT']==24].sort_values(by=['SCHOOL'])
web_d24 = df_web[df_web['DISTRICT']==24].sort_values(by=['School Name'])

In [297]:
school_d24.reset_index(inplace=True)
web_d24.reset_index(inplace=True)

In [298]:
# school_d24
# drop 0, 29, 37

In [299]:
# web_d24
# change 14 to IS 119 THE GLENDALE
# change 15 to IS 125 THOM J MCCANN WOODSIDE
# change 16 to I.S. 5 - THE WALTER CROWLEY INTERMEDIATE SCHOOL
# change 17 to IS 061 LEONARDO DA VINCI
# change 18 to I.S. 73 - THE FRANK SANSIVIERI INTERMEDIATE SCHOOL
# change 19 to IS 077
# change 20 to IS 093 RIDGEWOOD
# change 27 to PS 102 BAYVIEW
# change 29 to PS 012 JAMES B COLGATE
# change 30 to PS 128 JUNIPER VALLEY
# change 31 to PS 013 CLEMENT C MOORE
# change 32 to PS 014 FAIRVIEW
# change 33 to PS 143 LOUIS ARMSTRONG
# change 34 to PS 153 MASPETH ELEM
# change 35 to P.S.16Q
# change 36 to PS 019 MARINO JEANTET
# change 37 to PS 199 MAURICE A FITZGERALD
# change 38 to PS 229 EMANUEL KAPLAN
# change 39 to P.S. 239
# change 41 to PS 049 DOROTHY BONAWIT KOLE
# change 42 to PS 58 - SCHOOL OF HEROES
# change 43 to PS 068 CAMBRIDGE
# change 45 to PS 071 FOREST
# change 46 to PS 081 JEAN PAUL RICHTER
# change 47 to PS 088 SENECA
# change 48 to PS 089 ELMHURST
# change 49 to PS 091 RICHARD ARKWRIGHT
# change 51 to PS 087 MIDDLE VILLAGE
# change 52 to QUEENS VOCATIONAL AND TECHNICAL HIGH SCHOOL
# change 53 to ROBERT F.WAGNER, JR. SECONDARY SCHOOL FOR ARTS AND
# drop 0, 1, 3, 4, 5, 6, 7, 9, 11, 13, 21, 22, 25, 26, 28, 40, 44, 50, 52, 54, 55

In [300]:
index_24 = [14, 15, 16, 17, 18, 19, 20, 27, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 41, 42, 43, 45, 46, 47,
           48, 49, 51, 52, 53]
school_24 = ['IS 119 THE GLENDALE', 'IS 125 THOM J MCCANN WOODSIDE', 
            'I.S. 5 - THE WALTER CROWLEY INTERMEDIATE SCHOOL', 'IS 061 LEONARDO DA VINCI', 
            'I.S. 73 - THE FRANK SANSIVIERI INTERMEDIATE SCHOOL', 'IS 077', 'IS 093 RIDGEWOOD', 
            'PS 102 BAYVIEW', 'PS 012 JAMES B COLGATE', 'PS 128 JUNIPER VALLEY', 'PS 013 CLEMENT C MOORE', 
            'PS 014 FAIRVIEW', 'PS 143 LOUIS ARMSTRONG', 'PS 153 MASPETH ELEM', 'P.S.16Q', 
            'PS 019 MARINO JEANTET', 'PS 199 MAURICE A FITZGERALD', 'PS 229 EMANUEL KAPLAN', 
            'P.S. 239', 'PS 049 DOROTHY BONAWIT KOLE', 'PS 58 - SCHOOL OF HEROES', 'PS 068 CAMBRIDGE',
            'PS 071 FOREST', 'PS 081 JEAN PAUL RICHTER', 'PS 088 SENECA', 'PS 089 ELMHURST',
            'PS 091 RICHARD ARKWRIGHT', 'PS 087 MIDDLE VILLAGE', 'QUEENS VOCATIONAL AND TECHNICAL HIGH SCHOOL',
            'ROBERT F.WAGNER, JR. SECONDARY SCHOOL FOR ARTS AND']
for i,j in zip(index_24, school_24):
    web_d24.at[i, 'School Name'] = j

In [301]:
school_d24.drop(index=[0, 29, 37], inplace=True)
web_d24.drop(index=[0, 1, 3, 4, 5, 6, 7, 9, 11, 13, 21, 22, 25, 26, 28, 40, 44, 50, 54, 55], inplace=True)

In [302]:
print(len(school_d24))
print(len(web_d24))

36
36

In [303]:
school_d24.reset_index(inplace=True)
web_d24.reset_index(inplace=True)

In [304]:
school_d24.sort_values(by=['SCHOOL'], inplace=True)
web_d24.sort_values(by=['School Name'], inplace=True)

In [305]:
all_d24 = pd.concat([school_d24, web_d24], axis=1)

In [306]:
len(all_d24)

36

In [476]:
all_d24.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,1,924,24Q610,24,AVIATION CAREER & TECHNICAL EDUCATION HIGH SCHOOL,ICI2,HS,High School,2.97,A,...,0.645,6,Well-Developed,2,1076,Aviation Career And Technical Education High S...,"2,087",17.3,63.3%,24

In [477]:
all_d24.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 25

In [307]:
print(len(df_school[df_school['DISTRICT']==25]))
print(len(df_web[df_web['DISTRICT']==25]))

35
45

In [308]:
school_d25 = df_school[df_school['DISTRICT']==25].sort_values(by=['SCHOOL'])
web_d25 = df_web[df_web['DISTRICT']==25].sort_values(by=['School Name'])

In [309]:
school_d25.reset_index(inplace=True)
web_d25.reset_index(inplace=True)

In [310]:
# school_d25
# drop 26,

In [311]:
# web_d25
# change 5 to IS 237
# change 6 to I S 025 ADRIEN BLOCK
# change 7 to I S 250 THE ROBERT F. KENNEDY COMMUNITY MIDDLE SCHOOL
# change 9 to JHS 185 EDWARD BLEEKER
# change 10 to JHS 189 DANIEL CARTER BEARD
# change 11 to JHS 194 WILLIAM CARR
# change 13 to PS 107 THOMAS A DOOLEY
# change 14 to PS 120 QUEENS
# change 15 to PS 129 PATRICIA LARKIN
# change 17 to PS 154 QUEENS
# change 18 to PS 163 FLUSHING HEIGHTS
# change 19 to PS 164 QUEENS VALLEY
# change 20 to PS 165 EDITH K. BERGTRAUM
# change 21 to PS 169 BAY TERRACE
# change 22 to PS 184 FLUSHING MANOR
# change 23 to PS 193 ALFRED J KENNEDY
# change 24 to PS 020 JOHN BOWNE
# change 26 to PS 209 CLEARVIEW GARDENS
# change 27 to PS 021 EDWARD HART
# change 28 to PS 214 CADWALLADER COLDEN
# change 29 to PS 219 PAUL KLAPPER
# change 30 to PS 022 THOMAS JEFFERSON
# change 31 to PS 024 ANDREW JACKSON
# change 33 to PS 029 QUEENS
# change 34 to PS 032 STATE STREET
# change 35 to PS 079 FRANCIS LEWIS
# change 36 to PS 200 POMONOK
# change 40 to THE QUEENS SCHOOL OF INQUIRY
# drop 0, 1, 2, 4, 12, 16, 25, 32, 39, 43, 44

In [312]:
index_25 = [5, 6, 7, 9, 10, 11, 13, 14, 15, 17, 18, 19, 20, 21, 22, 24, 26, 27, 28, 29, 30, 31, 33, 34, 35, 36, 40]
school_25 = ['IS 237', 'I S 025 ADRIEN BLOCK', 'I S 250 THE ROBERT F. KENNEDY COMMUNITY MIDDLE SCHOOL',
            'JHS 185 EDWARD BLEEKER', 'JHS 189 DANIEL CARTER BEARD', 'JHS 194 WILLIAM CARR', 
            'PS 107 THOMAS A DOOLEY', 'PS 120 QUEENS', 'PS 129 PATRICIA LARKIN', 'PS 154 QUEENS', 
            'PS 163 FLUSHING HEIGHTS', 'PS 164 QUEENS VALLEY', 'PS 165 EDITH K. BERGTRAUM', 
            'PS 169 BAY TERRACE', 'PS 184 FLUSHING MANOR', 'PS 193 ALFRED J KENNEDY', 'PS 020 JOHN BOWNE', 
            'PS 209 CLEARVIEW GARDENS', 'PS 021 EDWARD HART', 'PS 214 CADWALLADER COLDEN', 'PS 219 PAUL KLAPPER',
            'PS 022 THOMAS JEFFERSON', 'PS 024 ANDREW JACKSON', 'PS 029 QUEENS', 'PS 032 STATE STREET', 
            'PS 079 FRANCIS LEWIS', 'PS 200 POMONOK', 'THE QUEENS SCHOOL OF INQUIRY']
for i,j in zip(index_25, school_25):
    web_d25.at[i, 'School Name'] = j

In [313]:
school_d25.drop(index=26, inplace=True)
web_d25.drop(index=[0, 1, 2, 4, 12, 16, 25, 32, 39, 43, 44], inplace=True)

In [314]:
print(len(school_d25))
print(len(web_d25))

34
34

In [315]:
school_d25.reset_index(inplace=True)
web_d25.reset_index(inplace=True)

In [316]:
school_d25.sort_values(by=['SCHOOL'], inplace=True)
web_d25.sort_values(by=['School Name'], inplace=True)

In [317]:
all_d25 = pd.concat([school_d25, web_d25], axis=1)

In [318]:
len(all_d25)

34

In [478]:
all_d25.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,956,25Q460,25,FLUSHING HIGH SCHOOL,ICI14,HS,High School,2.52,C,...,0.469,0,Proficient,3,1132,Flushing High School,"1,678",15.2,74.4%,25

In [479]:
all_d25.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 26

In [319]:
print(len(df_school[df_school['DISTRICT']==26]))
print(len(df_web[df_web['DISTRICT']==26]))

32
33

In [320]:
school_d26 = df_school[df_school['DISTRICT']==26].sort_values(by=['SCHOOL'])
web_d26 = df_web[df_web['DISTRICT']==26].sort_values(by=['School Name'])

In [321]:
school_d26.reset_index(inplace=True)
web_d26.reset_index(inplace=True)

In [322]:
# school_d26
# drop 17

In [323]:
# web_d26
# change 6 to JHS 216 GEORGE J RYAN
# change 7 to JHS 067 LOUIS PASTEUR
# change 8 to JHS 074 NATHANIEL HAWTHORNE
# change 10 to MS 158 MARIE CURIE
# change 11 to PS 133 QUEENS
# change 12 to PS 159
# change 13 to PS 162 JOHN GOLDEN
# change 14 to PS 173 FRESH MEADOWS
# change 15 to PS 018 WINCHESTER
# change 16 to PS 186 CASTLEWOOD
# change 17 to PS 188 KINGSBURY
# change 18 to PS 191 MAYFLOWER
# change 19 to PS 203 OAKLAND GARDENS
# change 20 to PS 205 ALEXANDER GRAHAM BELL
# change 21 to PS 213 The Carl Ullman School
# change 22 to PS 221 NORTH HILLS
# change 23 to PS 026 RUFUS KING
# change 24 to PS 031 BAYSIDE
# change 25 to PS 376
# change 26 to PS 041 CROCHERON
# change 27 to PS 046 ALLEY POND
# change 28 to PS 094 DAVID D PORTER
# change 29 to PS 098 THE DOUGLASTON SCHOOL
# change 30 to PS 178 HOLLISWOOD
# change 31 to P.S./I.S. 266
# drop 2, 5

In [324]:
index_26 = [6, 7, 8, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31]
school_26 = ['JHS 216 GEORGE J RYAN', 'JHS 067 LOUIS PASTEUR', 'JHS 074 NATHANIEL HAWTHORNE', 
            'MS 158 MARIE CURIE', 'PS 133 QUEENS', 'PS 159', 'PS 162 JOHN GOLDEN', 'PS 173 FRESH MEADOWS', 
            'PS 018 WINCHESTER', 'PS 186 CASTLEWOOD', 'PS 188 KINGSBURY', 'PS 191 MAYFLOWER', 
            'PS 203 OAKLAND GARDENS', 'PS 205 ALEXANDER GRAHAM BELL', 'PS 213 The Carl Ullman School',
            'PS 221 NORTH HILLS', 'PS 026 RUFUS KING', 'PS 031 BAYSIDE', 'PS 376', 'PS 041 CROCHERON',
            'PS 046 ALLEY POND', 'PS 094 DAVID D PORTER', 'PS 098 THE DOUGLASTON SCHOOL', 'PS 178 HOLLISWOOD',
            'P.S./I.S. 266']
for i,j in zip(index_26, school_26):
    web_d26.at[i, 'School Name'] = j

In [325]:
school_d26.drop(index=17, inplace=True)
web_d26.drop(index=[2, 5], inplace=True)

In [326]:
print(len(school_d26))
print(len(web_d26))

31
31

In [327]:
school_d26.reset_index(inplace=True)
web_d26.reset_index(inplace=True)

In [328]:
school_d26.sort_values(by=['SCHOOL'], inplace=True)
web_d26.sort_values(by=['School Name'], inplace=True)

In [329]:
all_d26 = pd.concat([school_d26, web_d26], axis=1)

In [330]:
len(all_d26)

31

In [480]:
all_d26.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,989,26Q495,26,BAYSIDE HIGH SCHOOL,ICI14,HS,High School,3.15,B,...,0.619,1.5,Proficient,0,1175,Bayside High School,"3,038",18.8,74%,26

In [481]:
all_d26.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 27

In [331]:
print(len(df_school[df_school['DISTRICT']==27]))
print(len(df_web[df_web['DISTRICT']==27]))

44
63

In [332]:
school_d27 = df_school[df_school['DISTRICT']==27].sort_values(by=['SCHOOL'])
web_d27 = df_web[df_web['DISTRICT']==27].sort_values(by=['School Name'])

In [333]:
school_d27.reset_index(inplace=True)
web_d27.reset_index(inplace=True)

In [334]:
# school_d27
# drop 1, 3, 26, 35, 37,

In [335]:
# web_d27[0:44]
# change 11 to JHS 202 ROBERT H GODDARD
# change 12 to JHS 210 ELIZABETH BLACKWELL
# change 13 to JHS 226 VIRGIL I GRISSOM
# change 16 to MS 137 AMERICA'S SCHL OF HEROES
# change 17 to I S 053 BRIAN PICCOLO
# change 19 to PS 100 GLEN MORRIS
# change 20 to PS 104 THE BAYS WATER
# change 21 to PS 105 THE BAY SCHOOL
# change 22 to PS 108 CAPT. VINCENT G. FOWLER
# change 23 to PS 123
# change 24 to PS 124 OSMOND A CHURCH
# change 25 to PS 146 HOWARD BEACH
# change 26 to PS 155
# change 27 to PS 183 DR. RICHARD R. GREEN
# change 28 to PS 197 THE OCEAN SCHOOL
# change 29 to PS 207 ROCKWOOD PARK
# change 30 to PS 223 LYNDON B JOHNSON
# change 31 to PS 232 LINDENWOOD
# change 32 to PS 253
# change 33 to PS 254
# change 36 to PS 043
# change 37 to PS 045 CLARENCE WITHERSPOON
# change 38 to PS 047 CHRIS GALAS
# change 40 to PS 056 HARRY EICHLER
# change 41 to PS 060 WOODHAVEN
# change 42 to PS 062 CHESTER PARK
# change 43 to PS 063 OLD SOUTH
# change 44 to PS 064 JOSEPH P. ADDABBO
# change 46 to PS 066 JACQUELINE KENNEDY ONASSIS
# change 47 to PS 090 HORACE MANN
# change 48 to PS 096
# change 49 to PS 097 FOREST PARK
# change 50 to PS/MS 114 BELLE HARBOR
# change 51 to PS 042 R VERNAM
# change 57 to THE SCHOLARS' ACADEMY
# drop 0, 1, 2, 5, 6, 7, 8, 9, 14, 15, 18, 34, 35, 39, 45, 52, 54, 55, 56, 58, 59, 60, 61, 62

In [336]:
index_27 = [11, 12, 13, 16, 17, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 36, 37, 38, 40, 41, 42,
           43, 44, 46, 47, 48, 49, 50, 51, 57]
school_27 = ['JHS 202 ROBERT H GODDARD', 'JHS 210 ELIZABETH BLACKWELL', 'JHS 226 VIRGIL I GRISSOM',
            'MS 137 AMERICAS SCHL OF HEROES', 'I S 053 BRIAN PICCOLO', 'PS 100 GLEN MORRIS', 
            'PS 104 THE BAYS WATER', 'PS 105 THE BAY SCHOOL', 'PS 108 CAPT. VINCENT G. FOWLER', 
            'PS 123', 'PS 124 OSMOND A CHURCH', 'PS 146 HOWARD BEACH', 'PS 155', 'PS 183 DR. RICHARD R. GREEN',
            'PS 197 THE OCEAN SCHOOL', 'PS 207 ROCKWOOD PARK', 'PS 223 LYNDON B JOHNSON', 'PS 232 LINDENWOOD', 
            'PS 253', 'PS 254', 'PS 043', 'PS 045 CLARENCE WITHERSPOON', 'PS 047 CHRIS GALAS', 'PS 056 HARRY EICHLER',
            'PS 060 WOODHAVEN', 'PS 062 CHESTER PARK', 'PS 063 OLD SOUTH', 'PS 064 JOSEPH P. ADDABBO', 
            'PS 066 JACQUELINE KENNEDY ONASSIS', 'PS 090 HORACE MANN', 'PS 096', 'PS 097 FOREST PARK', 
            'PS/MS 114 BELLE HARBOR', 'PS 042 R VERNAM', 'THE SCHOLARS ACADEMY']
for i,j in zip(index_27, school_27):
    web_d27.at[i, 'School Name'] = j

In [337]:
school_d27.drop(index=[1, 3, 26, 35, 37], inplace=True)
web_d27.drop(index=[0, 1, 2, 5, 6, 7, 8, 9, 14, 15, 18, 34, 35, 39, 45, 52, 54, 55, 56, 58, 59, 60, 61, 62], 
            inplace=True)

In [338]:
print(len(school_d27))
print(len(web_d27))

39
39

In [339]:
school_d27.reset_index(inplace=True)
web_d27.reset_index(inplace=True)

In [340]:
school_d27.sort_values(by=['SCHOOL'], inplace=True)
web_d27.sort_values(by=['School Name'], inplace=True)

In [341]:
all_d27 = pd.concat([school_d27, web_d27], axis=1)

In [342]:
len(all_d27)

39

In [482]:
all_d27.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,1031,27Q400,27,AUGUST MARTIN HIGH SCHOOL,KNLSO3,HS,High School,2.47,D,...,0.295,1.5,Well-Developed,3,1209,August Martin High School,328,13.1,86.3%,27

In [483]:
all_d27.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 28

In [343]:
print(len(df_school[df_school['DISTRICT']==28]))
print(len(df_web[df_web['DISTRICT']==28]))

37
50

In [344]:
school_d28 = df_school[df_school['DISTRICT']==28].sort_values(by=['SCHOOL'])
web_d28 = df_web[df_web['DISTRICT']==28].sort_values(by=['School Name'])

In [345]:
school_d28.reset_index(inplace=True)
web_d28.reset_index(inplace=True)

In [346]:
# school_d28
# drop 3, 9, 32

In [347]:
# web_d28
# change 1 to JHS 072 CATH. & COUNT BASIE
# change 11 to JHS 157 STEPHEN A HALSEY
# change 12 to JHS 190 RUSSELL SAGE
# change 13 to JHS 217 ROBERT A VAN WYCK
# change 14 to JHS 008 RICHARD S GROSSLEY
# change 17 to PS 101 SCHOOL IN THE GARDENS
# change 18 to PS 117 J.KELD/BRIARWOOD SCH
# change 19 to PS 121 QUEENS
# change 20 to PS 139 REGO PARK
# change 21 to PS 140 EDWARD K ELLINGTON
# change 22 to PS 144 COL JEROMUS REMSEN
# change 23 to PS 160 WALTER FRANCIS BISHOP
# change 24 to PS 161 ARTHUR ASHE SCHOOL
# change 25 to PS 174 WILLIAM SIDNEY MOUNT
# change 26 to PS 175 THE LYNN GROSS DISCOVERY SCHOOL
# change 28 to PS 196 GRAND CENTRAL PKWY
# change 29 to PS 206 HORACE HARDING
# change 30 to PS 220 EDWARD MANDEL
# change 31 to PS 040 SAMUEL HUNTINGTON
# change 32 to PS 048 WILLIAM WORDSWORTH
# change 33 to PS 050 TALFOURD LAWN ELEMENTARY SCHOOL
# change 34 to PS 054 HILLSIDE
# change 35 to PS 055 MAURE
# change 36 to PS 080 THURGOOD MARSHALL MAGNET
# change 37 to PS 082 HAMMOND
# change 38 to PS 086 QUEENS
# change 39 to PS 099 KEW GARDENS
# change 42 to QUEENS GATEWAY TO HEALTH SCIENCES SECONDARY SCHOOL
# change 47 to THOMAS A. EDISON CAREER AND TECHNICAL EDUCATION HI
# change 49 to YOUNG WOMEN'S LEADERSHIP SCHOOL QUEENS
# drop 0, 2, 4, 7, 8, 9, 10, 15, 16, 27, 40, 43, 44, 45, 46, 48

In [348]:
index_28 = [1, 11, 12, 13, 14, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 28, 29, 30, 31, 34, 35, 36, 37, 38, 39, 42,
           47, 49]
school_28 = ['JHS 072 CATH. & COUNT BASIE', 'JHS 157 STEPHEN A HALSEY', 'JHS 190 RUSSELL SAGE', 
            'JHS 217 ROBERT A VAN WYCK', 'JHS 008 RICHARD S GROSSLEY', 'PS 101 SCHOOL IN THE GARDENS', 
            'PS 117 J.KELD/BRIARWOOD SCH', 'PS 121 QUEENS', 'PS 139 REGO PARK', 'PS 140 EDWARD K ELLINGTON', 
            'PS 144 COL JEROMUS REMSEN', 'PS 160 WALTER FRANCIS BISHOP', 'PS 161 ARTHUR ASHE SCHOOL', 
            'PS 174 WILLIAM SIDNEY MOUNT', 'PS 175 THE LYNN GROSS DISCOVERY SCHOOL', 'PS 196 GRAND CENTRAL PKWY',
            'PS 206 HORACE HARDING', 'PS 220 EDWARD MANDEL', 'PS 040 SAMUEL HUNTINGTON', 'PS 048 WILLIAM WORDSWORTH',
            'PS 050 TALFOURD LAWN ELEMENTARY SCHOOL', 'PS 054 HILLSIDE', 'PS 055 MAURE', 'PS 080 THURGOOD MARSHALL MAGNET',
            'pS 082 HAMMOND', 'PS 086 QUEENS', 'PS 099 KEW GARDENS', 'QUEENS GATEWAY TO HEALTH SCIENCES SECONDARY SCHOOL',
            'THOMAS A. EDISON CAREER AND TECHNICAL EDUCATION HI', 'YOUNG WOMENS LEADERSHIP SCHOOL QUEENS']
for i,j in zip(index_28, school_28):
    web_d28.at[i, 'School Name'] = j

In [349]:
school_d28.drop(index=[3, 9, 32], inplace=True)
web_d28.drop(index=[0, 2, 4, 7, 8, 9, 10, 15, 16, 27, 40, 43, 44, 45, 46, 48], inplace=True)

In [350]:
print(len(school_d28))
print(len(web_d28))

34
34

In [351]:
school_d28.reset_index(inplace=True)
web_d28.reset_index(inplace=True)

In [352]:
school_d28.sort_values(by=['SCHOOL'], inplace=True)
web_d28.sort_values(by=['School Name'], inplace=True)

In [353]:
all_d28 = pd.concat([school_d28, web_d28], axis=1)

In [354]:
len(all_d28)

34

In [484]:
all_d28.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,1064,28Q440,28,FOREST HILLS HIGH SCHOOL,ICI2,HS,High School,2.95,B,...,0.587,4.5,Proficient,1,1279,JHS 072 CATH. & COUNT BASIE,378,11.1,81.7%,28

In [485]:
all_d28.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 29

In [355]:
print(len(df_school[df_school['DISTRICT']==29]))
print(len(df_web[df_web['DISTRICT']==29]))

36
46

In [356]:
school_d29 = df_school[df_school['DISTRICT']==29].sort_values(by=['SCHOOL'])
web_d29 = df_web[df_web['DISTRICT']==29].sort_values(by=['School Name'])

In [357]:
school_d29.reset_index(inplace=True)
web_d29.reset_index(inplace=True)

In [358]:
# school_d29
# drop 0, 7, 9, 13,

In [359]:
# web_d29
# change 0 to THE BELLAIRE SCHOOL
# change 10 to HUMANITIES & ARTS MAGNET HIGH SCHOOL
# change 12 to IS 192 THE LINDEN
# change 13 to I S 238 SUSAN B ANTHONY
# change 14 to I S 059 SPRINGFIELD GARDENS
# change 16 to MATHEMATICS, SCIENCE RESEARCH AND TECHNOLOGY MAGNET
# change 19 to PS 118 LORRAINE HANSBERRY
# change 20 to PS 131 ABIGAIL ADAMS
# change 21 to PS 132 RALPH BUNCHE
# change 22 to PS 134 HOLLIS
# change 23 to PS 136 ROY WILKINS
# change 24 to PS 015 JACKIE ROBINSON
# change 25 to PS 156 LAURELTON
# change 26 to PS 176 CAMBRIA HEIGHTS
# change 27 to PS 181 BROOKFIELD
# change 28 to PS 195 WILLIAM HABERLE
# change 30 to PS 033 EDWARD M. FUNK
# change 31 to PS 034 JOHN HARVARD
# change 32 to PS 035 NATHANIEL WOODHULL
# change 33 to PS 036 ST ALBANS SCHOOL
# change 35 to PS 038 ROSEDALE
# change 36 to PS 052 QUEENS
# change 37 to PS 095 EASTWOOD
# change 38 to PS 116 WILLIAM C. HUGHLEY
# change 39 to P.S./I.S. 208
# change 40 to P.S. 268
# change 42 to PS 138 SUNRISE
# change 43 to PS 147 RONALD MCNAIR
# drop 1, 2, 3, 4, 6, 7, 9, 11, 18, 29, 34, 41, 44, 45

In [360]:
index_29 = [0, 10, 12, 13, 14, 16, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 30, 31, 32, 33, 35, 36, 37, 38, 39,
           40, 42, 43]
school_29 = ['THE BELLAIRE SCHOOL', 'HUMANITIES & ARTS MAGNET HIGH SCHOOL', 'IS 192 THE LINDEN', 
            'I S 238 SUSAN B ANTHONY', 'I S 059 SPRINGFIELD GARDENS', 
            'MATHEMATICS, SCIENCE RESEARCH AND TECHNOLOGY MAGNET',
            'PS 118 LORRAINE HANSBERRY', 'PS 131 ABIGAIL ADAMS', 'PS 132 RALPH BUNCHE', 'PS 134 HOLLIS',
            'PS 136 ROY WILKINS', 'PS 015 JACKIE ROBINSON', 'PS 156 LAURELTON', 'PS 176 CAMBRIA HEIGHTS',
            'PS 181 BROOKFIELD', 'PS 195 WILLIAM HABERLE', 'PS 033 EDWARD M. FUNK', 'PS 034 JOHN HARVARD', 
            'PS 035 NATHANIEL WOODHULL', 'PS 036 ST ALBANS SCHOOL', 'PS 038 ROSEDALE', 'PS 052 QUEENS',
            'PS 095 EASTWOOD', 'PS 116 WILLIAM C. HUGHLEY', 'P.S./I.S. 208', 'P.S. 268', 'PS 138 SUNRISE',
            'PS 147 RONALD MCNAIR']
for i,j in zip(index_29, school_29):
    web_d29.at[i, 'School Name'] = j

In [361]:
school_d29.drop(index=[0, 7, 9, 13], inplace=True)
web_d29.drop(index=[1, 2, 3, 4, 6, 7, 9, 11, 18, 29, 34, 41, 44, 45], inplace=True)

In [362]:
print(len(school_d29))
print(len(web_d29))

32
32

In [363]:
school_d29.reset_index(inplace=True)
web_d29.reset_index(inplace=True)

In [364]:
school_d29.sort_values(by=['SCHOOL'], inplace=True)
web_d29.sort_values(by=['School Name'], inplace=True)

In [365]:
all_d29 = pd.concat([school_d29, web_d29], axis=1)

In [366]:
len(all_d29)

32

In [486]:
all_d29.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,1,1078,29Q037,29,CYNTHIA JENKINS SCHOOL,ESO21,ESMS,Elementary School,66.76,B,...,0.767,4.5,Proficient,0,1340,THE BELLAIRE SCHOOL,989,16.2,57.4%,29

In [487]:
all_d29.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 30

In [367]:
print(len(df_school[df_school['DISTRICT']==30]))
print(len(df_web[df_web['DISTRICT']==30]))

38
48

In [368]:
school_d30 = df_school[df_school['DISTRICT']==30].sort_values(by=['SCHOOL'])
web_d30 = df_web[df_web['DISTRICT']==30].sort_values(by=['School Name'])

In [369]:
school_d30.reset_index(inplace=True)
web_d30.reset_index(inplace=True)

In [370]:
# school_d30
# drop 2,

In [371]:
# web_d30
# change 11 to IS 010 HORACE GREELEY
# change 12 to IS 141 THE STEINWAY
# change 13 to IS 145 JOSEPH PULITZER
# change 14 to IS 204 OLIVER W HOLMES
# change 15 to I S 227 LOUIS ARMSTRONG
# change 16 to INTERMEDIATE SCHOOL 230
# change 20 to PS 011 KATHRYN PHELAN
# change 21 to PS 111 JACOB BLACKWELL
# change 22 to PS 112 DUTCH KILLS
# change 23 to PS 122 MAMIE FAY
# change 24 to PS 127 AEROSPACE SCIENCE MAGNE
# change 25 to PS 148 QUEENS
# change 26 to PS 149 CHRISTA MCAULIFFE
# change 27 to PS 150 QUEENS
# change 28 to PS 151 MARY D. CARTER
# change 29 to PS 152 GWENDOLYN ALLEYNE
# change 30 to PS 166 HENRY GRADSTEIN
# change 31 to PS 017 HENRY DAVID THOREAU
# change 32 to PS 171 PETER G VAN ALST
# change 33 to PS 002 ALFRED ZIMBERG
# change 34 to PS 212
# change 36 to P.S. 234
# change 38 to PS 069 JACKSON HEIGHTS
# change 39 to PS 070 QUEENS
# change 40 to PS 076 WILLIAM HALLET
# change 41 to PS 084 STEINWAY
# change 42 to PS 085 JUDGE CHARLES VALLONE
# change 43 to PS 092 HARRY T STEWART SR.
# change 44 to PS 078
# drop 0, 1, 2, 6, 7, 9, 17, 35, 37, 46, 47

In [372]:
index_30 = [11, 12, 13, 14, 15, 16, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 36, 38, 39, 40, 
           41, 42, 43, 44]
school_30 = ['IS 010 HORACE GREELEY', 'IS 141 THE STEINWAY', 'IS 145 JOSEPH PULITZER', 'IS 204 OLIVER W HOLMES',
            'I S 227 LOUIS ARMSTRONG', 'INTERMEDIATE SCHOOL 230', 'PS 011 KATHRYN PHELAN', 
            'PS 111 JACOB BLACKWELL', 'PS 112 DUTCH KILLS', 'PS 122 MAMIE FAY', 'PS 127 AEROSPACE SCIENCE MAGNET',
            'PS 148 QUEENS', 'PS 149 CHRISTA MCAULIFFE', 'PS 150 QUEENS', 'PS 151 MARY D. CARTER', 
            'PS 152 GWENDOLYN ALLEYNE', 'PS 166 HENRY GRADSTEIN', 'PS 017 HENRY DAVID THOREAU', 
            'PS 171 PETER G VAN ALST', 'PS 002 ALFRED ZIMBERG', 'PS 212', 'P.S. 234', 'PS 069 JACKSON HEIGHTS',
            'PS 070 QUEENS', 'PS 076 WILLIAM HALLET', 'PS 084 STEINWAY', 'PS 085 JUDGE CHARLES VALLONE',
            'PS 092 HARRY T STEWART SR.', 'PS 078']
for i,j in zip(index_30, school_30):
    web_d30.at[i, 'School Name'] = j

In [373]:
school_d30.drop(index=2, inplace=True)
web_d30.drop(index=[0, 1, 2, 6, 7, 9, 17, 35, 37, 46, 47], inplace=True)

In [374]:
print(len(school_d30))
print(len(web_d30))

37
37

In [375]:
school_d30.reset_index(inplace=True)
web_d30.reset_index(inplace=True)

In [376]:
school_d30.sort_values(by=['SCHOOL'], inplace=True)
web_d30.sort_values(by=['School Name'], inplace=True)

In [377]:
all_d30 = pd.concat([school_d30, web_d30], axis=1)

In [378]:
len(all_d30)

37

In [488]:
all_d30.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,1144,30Q575,30,ACADEMY OF AMERICAN STUDIES,ICI16,HS,High School,3.13,B,...,0.538,0,Well-Developed,3,1391,Academy Of American Studies,"1,016",20.6,68.5%,30

In [489]:
all_d30.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 31

In [379]:
print(len(df_school[df_school['DISTRICT']==31]))
print(len(df_web[df_web['DISTRICT']==31]))

61
72

In [380]:
school_d31 = df_school[df_school['DISTRICT']==31].sort_values(by=['SCHOOL'])
web_d31 = df_web[df_web['DISTRICT']==31].sort_values(by=['School Name'])

In [381]:
school_d31.reset_index(inplace=True)
web_d31.reset_index(inplace=True)

In [382]:
# school_d31[44:61]
# drop 13, 21, 35, 43

In [390]:
# web_d31[0:44]
# change 8 to I S 002 GEORGE L EGBERT
# change 9 to I S 024 MYRA S BARNES
# change 10 to IS 027 ANNING S PRALL
# change 11 to I S 034 TOTTENVILLE
# change 12 to IS 49 Berta A. Dreyfus
# change 13 to I S 051 EDWIN MARKHAM
# change 14 to I S 061 WILLIAM A MORRIS
# change 15 to IS 007 ELIAS BERNSTEIN
# change 16 to IS 072 ROCCO LAURIE
# change 17 to I S 075 FRANK D PAULO
# change 20 to MICHAEL J. PETRIDES HIGH SCHOOL
# change 25 to PS 001 TOTTENVILLE
# change 26 to PS 11 Thomas Dongan School
# change 27 to PS 013 M L LINDENMEYER
# change 28 to PS 016 JOHN J DRISCOLL
# change 29 to PS 018 JOHN G WHITTIER
# change 30 to PS 019 THE CURTIS SCHOOL
# change 31 to PS 020 PORT RICHMOND
# change 32 to PS 21 MARGARET EMERY-ELM PARK
# change 33 to PS 022 GRANITEVILLE
# change 34 to PS 023 RICHMONDTOWN
# change 35 to PS 026 THE CARTERET SCHOOL
# change 36 to PS 029 BARDWELL
# change 37 to PS 003 THE MARGARET GIOIOSA SCHOOL
# change 38 to PS 030 WESTERLEIGH
# change 39 to PS 031 WILLIAM T DAVIS
# change 40 to PS 032 THE GIFFORD SCHOOL
# change 41 to PS 35 The Clove Valley School
# change 42 to PS 036 J C DRUMGOOLE
# change 43 to PS 038 GEORGE CROMWELL
# change 44 to PS 39 FRANCIS J MURPHY JR.
# change 45 to PS 004 MAURICE WOLLIN
# change 46 to PS 042 ELTINGVILLE
# change 47 to PS 044 THOMAS C BROWN
# change 48 to PS 045 JOHN TYLER
# change 49 to PS 046 ALBERT V. MANISCALCO
# change 50 to PS 048 WILLIAM C WILCOX
# change 51 to PS 005 HUGUENOT
# change 52 to PS 050 FRANK HANKINSON
# change 53 to PS 052 JOHN C THOMPSON
# change 54 to PS 054 CHARLES W LENG
# change 55 to PS 055 HENRY M BOEHM
# change 56 to PS 56 THE LOUIS DESARIO SCHOOL
# change 57 to PS 057 HUBERT H HUMPHREY
# change 58 to PS 6 CPL ALLAN F KIVLEHAN SCHL
# change 59 to PS 060 ALICE AUSTEN
# change 61 to PS 069 DANIEL D TOMPKINS
# change 64 to PS 8 SHIRLEE SOLOMON
# change 66 to S.S. COLUMBIA SCHOOL
# drop 0, 2, 4, 5, 6, 7, 18, 19, 21, 24, 60, 62, 63, 67, 69

In [392]:
index_31 = [8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 20, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39,
           40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 61, 64, 66]
school_31 = ['I S 002 GEORGE L EGBERT', 'I S 024 MYRA S BARNES', 'IS 027 ANNING S PRALL', 
            'I S 034 TOTTENVILLE', 'IS 49 Berta A. Dreyfus', 'I S 051 EDWIN MARKHAM', 'I S 061 WILLIAM A MORRIS',
            'IS 007 ELIAS BERNSTEIN', 'IS 072 ROCCO LAURIE', 'I S 075 FRANK D PAULO', 
            'MICHAEL J. PETRIDES HIGH SCHOOL', 'PS 001 TOTTENVILLE', 'PS 11 Thomas Dongan School',
            'PS 013 M L LINDENMEYER', 'PS 016 JOHN J DRISCOLL', 'PS 018 JOHN G WHITTIER', 
            'PS 019 THE CURTIS SCHOOL', 'PS 020 PORT RICHMOND', 'PS 21 MARGARET EMERY-ELM PARK', 
            'PS 022 GRANITEVILLE', 'PS 023 RICHMONDTOWN', 'PS 026 THE CARTERET SCHOOL', 'PS 029 BARDWELL',
            'PS 003 THE MARGARET GIOIOSA SCHOOL', 'PS 030 WESTERLEIGH', 'PS 031 WILLIAM T DAVIS',
            'PS 032 THE GIFFORD SCHOOL', 'PS 35 The Clove Valley School', 'PS 036 J C DRUMGOOLE',
            'PS 038 GEORGE CROMWELL', 'PS 39 FRANCIS J MURPHY JR.', 'PS 004 MAURICE WOLLIN',
            'PS 042 ELTINGVILLE', 'PS 044 THOMAS C BROWN', 'PS 045 JOHN TYLER', 'PS 046 ALBERT V. MANISCALCO',
            'PS 048 WILLIAM C WILCOX', 'PS 005 HUGUENOT', 'PS 050 FRANK HANKINSON', 'PS 052 JOHN C THOMPSON',
            'PS 054 CHARLES W LENG', 'PS 055 HENRY M BOEHM', 'PS 56 THE LOUIS DESARIO SCHOOL', 
            'PS 057 HUBERT H HUMPHREY', 'PS 6 CPL ALLAN F KIVLEHAN SCHL', 'PS 060 ALICE AUSTEN', 
            'PS 069 DANIEL D TOMPKINS', 'PS 8 SHIRLEE SOLOMON', 'S.S. COLUMBIA SCHOOL']
for i,j in zip(index_31, school_31):
    web_d31.at[i, 'School Name'] = j

In [393]:
school_d31.drop(index=[13, 21, 35, 43], inplace=True)
web_d31.drop(index=[0, 2, 4, 5, 6, 7, 18, 19, 21, 24, 60, 62, 63, 67, 69], inplace=True)

In [394]:
print(len(school_d31))
print(len(web_d31))

57
57

In [395]:
school_d31.reset_index(inplace=True)
web_d31.reset_index(inplace=True)

In [396]:
school_d31.sort_values(by=['SCHOOL'], inplace=True)
web_d31.sort_values(by=['School Name'], inplace=True)

In [397]:
all_d31 = pd.concat([school_d31, web_d31], axis=1)

In [398]:
len(all_d31)

57

In [490]:
all_d31.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,1245,79R470,31,CONCORD HIGH SCHOOL,ESO16,HS,Transfer School,NA,B,...,0.316,2.25,Proficient,1,1415,Concord High School,166,12.9,71.7%,31

In [491]:
all_d31.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### District 32

In [399]:
print(len(df_school[df_school['DISTRICT']==32]))
print(len(df_web[df_web['DISTRICT']==32]))

26
26

In [400]:
school_d32 = df_school[df_school['DISTRICT']==32].sort_values(by=['SCHOOL'])
web_d32 = df_web[df_web['DISTRICT']==32].sort_values(by=['School Name'])

In [401]:
school_d32.reset_index(inplace=True)
web_d32.reset_index(inplace=True)

In [415]:
# school_d32
# drop 2, 5, 6, 11, 13

In [416]:
# web_d32
# change 1 to ACADEMY OF URBAN PLANNING
# change 8 to IS 347 SCHOOL OF HUMANITIES
# change 9 to IS 349 MATH, SCIENCE & TECH.
# change 10 to JHS 162 THE WILLOUGHBY
# change 11 to JHS 291 ROLAND HAYES
# change 12 to JHS 383 PHILLIPPA SCHUYLER
# change 13 to PS 106 EDWARD EVERETT HALE
# change 14 to PS 116 ELIZABETH L FARRELL
# change 15 to PS 123 SUYDAM
# change 16 to PS 145 ANDREW JACKSON
# change 17 to PS 151 LYNDON B JOHNSON
# change 18 to PS 274 KOSCIUSKO
# change 19 to PS 299 THOMAS WARREN FIELD
# change 21 to PS 377 ALEJANDRINA B DEGAUTIER
# change 22 to PS 075 MAYDA CORTIELLA
# change 23 to PS 086 THE IRVINGTON
# change 24 to PS 384 FRANCES E CARTER
# change 25 to PS 045 HORACE E GREENE
# drop 0, 3, 4, 7, 20

In [417]:
index_32 = [1, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 21, 22, 23, 24, 25]
school_32 = ['ACADEMY OF URBAN PLANNING', 'IS 347 SCHOOL OF HUMANITIES', 'IS 349 MATH, SCIENCE & TECH.', 
            'JHS 162 THE WILLOUGHBY', 'JHS 291 ROLAND HAYES', 'JHS 383 PHILLIPPA SCHUYLER', 
            'PS 106 EDWARD EVERETT HALE', 'PS 116 ELIZABETH L FARRELL', 'PS 123 SUYDAM', 'PS 145 ANDREW JACKSON',
            'PS 151 LYNDON B JOHNSON', 'PS 274 KOSCIUSKO', 'PS 299 THOMAS WARREN FIELD', 
            'PS 377 ALEJANDRINA B DEGAUTIER', 'PS 075 MAYDA CORTIELLA', 'PS 086 THE IRVINGTON',
            'PS 384 FRANCES E CARTER', 'PS 045 HORACE E GREENE']
for i,j in zip(index_32, school_32):
    web_d32.at[i, 'School Name'] = j

In [418]:
school_d32.drop(index=[2, 5, 6, 11, 13], inplace=True)
web_d32.drop(index=[0, 3, 4, 7, 20], inplace=True)

In [419]:
print(len(school_d32))
print(len(web_d32))

21
21

In [420]:
school_d32.reset_index(inplace=True)
web_d32.reset_index(inplace=True)

In [421]:
school_d32.sort_values(by=['SCHOOL'], inplace=True)
web_d32.sort_values(by=['School Name'], inplace=True)

In [422]:
all_d32 = pd.concat([school_d32, web_d32], axis=1)

In [423]:
len(all_d32)

21

In [492]:
all_d32.head(1)

,level_0,index,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,...,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,level_0,index,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
0,0,1229,32K552,32,ACADEMY OF URBAN PLANNING,ICI14,HS,High School,2.35,C,...,0.396,0,Undeveloped,1,1507,ACADEMY OF URBAN PLANNING,202,10.6,98%,32

In [493]:
all_d32.drop(columns=['School Name', 'index', 'DBN', 'SCHOOL SUPPORT ORGANIZATION/NETWORK', 
                    'PROGRESS REPORT TYPE', 'DISTRICT', 'level_0'], inplace=True)

### Filtering to check if school's were in different places

In [413]:
df_school[df_school['SCHOOL'].str.contains('HORACE')]

,DBN,DISTRICT,SCHOOL,SCHOOL SUPPORT ORGANIZATION/NETWORK,PROGRESS REPORT TYPE,SCHOOL LEVEL*,PEER INDEX*,GRADE,OVERALL SCORE,ENVIRONMENT CATEGORY SCORE,PERFORMANCE CATEGORY SCORE,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE
1003,27Q090,27,PS 090 HORACE MANN,KNLSO5,ESMS,Elementary School,55.79,C,47.63,0.534,0.739,0.304,0.75,Well-Developed
1061,28Q206,28,PS 206 HORACE HARDING,ICI19,ESMS,Elementary School,47.36,C,49.19,0.48,0.537,0.402,3.75,Well-Developed
1110,30Q010,30,IS 010 HORACE GREELEY,ICI13,ESMS,Middle School,3.22,A,71.53,0.634,0.56,0.713,6,Well-Developed
1207,32K045,32,PS 045 HORACE E GREENE,CLSO1,ESMS,Elementary School,78.17,A,77.85,0.545,0.69,0.768,6.75,Proficient

In [414]:
df_web[df_web['School Name'].str.contains('New York')]

,School Name,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch,DISTRICT
102,Urban Assembly New York Harbor School,532,14.7,53.8%,2

### Concat all dataframes

In [495]:
clean_data = pd.concat([all_d1, all_d2, all_d3, all_d4, all_d5, all_d6, all_d7, all_d8, all_d9,
          all_d10, all_d11, all_d12, all_d13, all_d14, all_d15, all_d16, all_d17,
          all_d18, all_d19, all_d20, all_d21, all_d22, all_d23, all_d24, all_d25,
          all_d26, all_d27, all_d28, all_d29, all_d30, all_d31, all_d32], ignore_index=True)

In [498]:
clean_data.head()

,SCHOOL,SCHOOL LEVEL*,PEER INDEX*,GRADE,OVERALL SCORE,ENVIRONMENT CATEGORY SCORE,PERFORMANCE CATEGORY SCORE,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch
0,BARD HIGH SCHOOL EARLY COLLEGE,High School,3.77,B,57.8,0.715,0.607,0.524,0,Well-Developed,589,17.3,43.5%
1,CHILDREN'S WORKSHOP SCHOOL,Elementary School,39.10,B,56.81,0.508,0.462,0.615,1.5,Proficient,318,16.7,45.3%
2,EARTH SCHOOL,Elementary School,41.67,B,55.18,0.985,0.446,0.492,0,Well-Developed,349,12.0,52.4%
3,EAST SIDE COMMUNITY HIGH SCHOOL,High School,2.66,A,71.33,0.788,0.64,0.624,6,Well-Developed,678,13.8,65.3%
4,MARTA VALLE SECONDARY SCHOOL,High School,2.63,C,36.0,0.25,0.387,0.375,0,Undeveloped,149,12.4,93.3%

In [500]:
# source: https://stackoverflow.com/questions/13682044/remove-unwanted-parts-from-strings-in-a-column
clean_data['Free-Reduced Lunch'] = clean_data['Free-Reduced Lunch'].map(lambda x: x.strip('%'))

In [501]:
clean_data.head()

,SCHOOL,SCHOOL LEVEL*,PEER INDEX*,GRADE,OVERALL SCORE,ENVIRONMENT CATEGORY SCORE,PERFORMANCE CATEGORY SCORE,PROGRESS CATEGORY SCORE,ADDITIONAL CREDIT,QUALITY REVIEW SCORE,Enrollment,Student-Teacher Ratio,Free-Reduced Lunch
0,BARD HIGH SCHOOL EARLY COLLEGE,High School,3.77,B,57.8,0.715,0.607,0.524,0,Well-Developed,589,17.3,43.5
1,CHILDREN'S WORKSHOP SCHOOL,Elementary School,39.10,B,56.81,0.508,0.462,0.615,1.5,Proficient,318,16.7,45.3
2,EARTH SCHOOL,Elementary School,41.67,B,55.18,0.985,0.446,0.492,0,Well-Developed,349,12.0,52.4
3,EAST SIDE COMMUNITY HIGH SCHOOL,High School,2.66,A,71.33,0.788,0.64,0.624,6,Well-Developed,678,13.8,65.3
4,MARTA VALLE SECONDARY SCHOOL,High School,2.63,C,36.0,0.25,0.387,0.375,0,Undeveloped,149,12.4,93.3

### Make data into csv file: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html

In [502]:
clean_data.to_csv('clean_data.csv')